[		
	{
		"version": "1.0.14",
        "date": "Sep 3 2025",
        "content": [
			"Logo changeup to celebrate a massive 200M total lifetime players! Roll over Angry Birds - the eggs have arrived",
			"Blast off to School: Rocket your way to the schoolyard with space themed maps, skins and more!",
			"This month's VIP item is the Saturn Rings! Suit up in the shop OR get it free as a VIP!",
			"Mid month VIP gets even better with the Premium School Bus Melee. Your frenemies WILL yield!",
			"In Space, no-one can hear you scream - The new Xenomorph bundle is here",
			"Start the countdown! A brand new map: Orbital has been added to all map pools.",
			"The Public Map pool has been switched up & now contains 15 different Shell Shockers Maps."
		]
	},{
		"version": "1.0.13",
        "date": "Aug 8 2025",
        "content": [
			"Celebrating a <b>massive 200 Million</b> lifetime players. Thank you all for being cracked!",
			"Prehistoric Pixels Update: An eggstounding three sets have been unvaulted - Photobooth, Mobile & Dinos",
			"This month's VIP item is the Polaroid Nade! Snap it up in the shop & VIPs get it free!",
			"Mid month gets even better with the Premium item changing to the Cyborg Whipper, designed to break shells",
			"The latest permanent Premium item is the Cellphone Grenade! Answer the call with your egg total!",
			"From prehistory to your computer - The new Megalodon bundle is guaranteed to take a bite out of your enemies",
			"A brand new community map: Cobalt has been added to all map pools. Seeing as you 'Blue' us away with these numbers!",
			"The Public Map pool has been switched up & now contains 15 different Shell Shockers Maps."
		]
	},{
		"version": "1.0.9",
        "date": "July 2 2025",
        "content": [
			"Summertime - and the living is easy! Welcome to the Summer Vacation update.",
			"The Wizards are enjoying some downtime and you can too! All Summer items unvaulted.",
			"You hear that music? A funky VIP item scuttles your way - Try the Premium Crab Rave Grenade!",
			"That's not all! The new permanent Premium item is the Basket Bros Grenade! Pick it up now in-store.",
			"The Killstreaker Bundle features some previously giveaway only items and something eggstra!",
			"Any caped crusaders out there? Some classic EGG ORG Inmates have escaped. Investigate the new map Inmates in lobbies now!",
			"The Public Map pool has been switcharoo'd and now contains 15 different Shell Shockers Maps."
		]
	},{
		"version": "1.0.7",
        "date": "June 3 2025",
        "content": [
			"Hit the gas with the latest Shell Shockers update introducing our smash new game - Kartbros.io.",
			"Enjoy the new Kart Bros items, plus some of the other faves from the Kart and Bros sets in-store now.",
			"Start your engines - a new VIP item has entered the store - Try the Premium Banana Grenade!",
			"The Ridge Racer Bundle features The slick F1 racer Melee - wipe out your frenemies!",
			"So we kinda broke controllers a little bit - fixed for all the joystick jockeys.",
			"Another range of bug fixes, optimizations, ratchet tightening and squeegeeing has taken place behind the scenes.",
			"Buckle up for the eggsciting new map: Zoomies - in public & private lobbies.",
			"The Public Map pool has been switched and now contains 15 of your favorite Shell Shockers Maps."
		]
	},{
		"version": "1.0.1",
        "date": "May 1 2025",
        "content": [
			"Lock in & look out eggventurers, it's time for the Leggacy of the Sun update!",
			"Congrats to the winners of the EGG ORG takeover - all players have been awarded an Eggsassin Stamp!",
			"We liked random killstreak bonuses so much we decided to keep them!",
			"Eggiana Jones has arrived - the newest item bundle featuring a cracking new melee!",
			"Throw Throw Apocalypto! Try the latest Premium Mayan Grenade - in-store & free for VIPs ",
			"We got a hot one! Try the latest map Greenhouse in public & private lobbies",
			"The Public Map pool has been overhauled! The Egg Org Maps are gone, replaced by a range of Mayan maps & old favorites!"
		]
	},{
		"version": "1.0.0",
        "date": "Apr 1 2025",
        "content": [
			"EGG ORG have returned from the shadows! Sides have been drawn & only one will win!",
			"The winning side will unlock a special skin for all eggs!",
			"Get more info, check the score & change sides by clicking the banner on the homescreen",
			"Changing teams is possible but costly!",
			"EGG ORG are messing with eggtopia, all killstreak bonuses are now RANDOM!",
			"Be the biggest egg in the Dojo with the latest Premium Sumo Hat - in-store & free for VIPs ",
			"Upgraded database to the latest SQL version - let us know if something is unusual... more than normal.",
			"Enjoy the latest map, Yolkido, in public and private lobbies",
			"Moved Outer Reach, Facility, Timetwist, Jailbreak, Wreckage & Exposure to the Public map pool",
			"Moved Uncovered, Foundation, Metamorph, Shipyard, Road, Shellville & Cash to the Private map pool"
		]
	},{
		"version": "0.50.11",
        "date": "Mar 19 2025",
        "content": [
			"Take a trip with us to Easter Island! Maybe find some hidden eggs!",
			"Moai statues everywhere! Equip the latest Premium Melee, free for VIPs & rock your opponents",
			"The latest frosty firearm is available in the shop - The Frostfall Cluck9mm",
			"Fixed Uncovered KotC option by removing the option - no more missing coops",
			"A:B test complete, all new players now get the Chickaletta Grenade on home screen",
			"Moved Two Towers, Growler, Fort Flip, Cash & Quarry to the Public map pool",
			"Moved Aqueduct, Maze Runner, Lunar Module, Hydro, Stage, Catacombs & Backstage to the Private map pool"
		]
	},{
		"version": "0.50.10",
        "date": "Mar 4 2025",
        "content": [
			"Welcome to the latest update - Shamrocked! Get ready to grab some leprechaun loot",
			"The Music skins AND St Patricks Day skins are BOTH in the shop at once. Fill yer boots!",
			"Play that funky music on both the music maps, Stage & Backstage returning to public lobbies",
			"Twitch Drops is still going for one more day! There's still time to get all the items you need ",
			"Grab the latest roaming rascal bundle - The Wandering Minstrel - complete with premium Bouzouki Bazooka",
			"MORE improvements made to game load, shaving off seconds for chromebooks - can't stop, won't stop",
			"Duel map extravaganza - 3 small community made duel maps added to the game: Metamorph, Foundation, & Uncovered",
			"Thanks to community members Godric & Ishmyster for the submissions",
			"Moved Road, Shellville, Shipyard, Blue, Stage & Backstage to the Public map pool",
			"Moved Teggtris, Enchanted, Spellbound, King's Court & Nextdoor to the Private map pool"
		]
	},{
		"version": "0.50.9",
        "date": "Feb 18 2025",
        "content": [
			"Watch and earn with Twitch Drops 7! <a target='_blank' title='here' href='https://shellshock.io/twitch/?utm_medium=referral&utm_campaign=changelog'>Link your Twitch & Shell Shockers accounts</a> & watch to earn eggsclusive items!",
			"Some of the best community skins and maps have been added in for your enjoyment",
			"Further Chromebook optimisations! Homepage loading time further improved!",
			"With the optimisations comes a new loading screen - more eggdoll = more betterer",
			"Small tweaks made to the latest map - Indigo",
			"Moved Aqueduct, Maze Runner, Lunar Module, King's Court & Nextdoor to the Public map pool",
			"Moved Overcooked, Palace Seige, Bedrock, Backstage, Vert & Starship to the Private map pool"
		]
	},{
		"version": "0.50.8",
        "date": "Feb 4 2025",
        "content": [
			"Fall in love with the new <strong>What A Catch</strong> Valentines Update!",
			"Optimizations added for Chromebooks - they hold a special place in our heart",
			"Snag yourself the new bundle in-store now - In Rod we Trust!",
			"Weapon Balance - Crackshot ammo changed to 12 reserve shots",
			"New Invite links - Join games with 3 easy to remember words!",
			"Glitched block on Starship fixed - You can still fall off though... Watch out for that. ",
			"Check out the latest map Indigo - available in public and private lobbies",
			"Moved Teggtris, Enchanted, Spellbound, Overcooked & Hydro to the Public map pool",
			"Moved Mud Gulch, Moonbase, Outer Reach, Feedlot & Ruins to the Private map pool"
		]
	},{
		"version": "0.50.7",
        "date": "Jan 15 2025",
        "content": [
			"We have arrived in 2025 - enjoy the <strong>We're so Back</strong> update!",
			"To celebrate Chinese new year and the solstice, the Equinox skins have returned to the shop",
			"The Eggstra Value Pack is here - 1 Week VIP, No Ads, 5 Items, 50,000 Eggs - Only $1! Purchasable one time only",
			"Weapon Balance - Crackshot movement accuracy and ammo lowered",
			"Weapon Balance - Tri-Hard now cannot one shot BUT it is more accurate and improved!",
			"Weapon Balance - The Scrambler has had it's range tightened up. The one stop punch is so back",
			"Eggsmas was so last year - We've taken the decorations down to make way for the classic maps",
			"Moved Palace Siege, Bedrock, Backstage, Vert & Starship to the Public map pool",
			"Moved Cluckgrounds, Dirt, Scales, Maze Runner, Facility & Wonderland to the Private map pool"
		]
	},{
		"version": "0.50.6",
        "date": "December 17 2024",
        "content": [
			"The Quarter Century is here - Shellebrate with the 2025 New Year skins!",
			"These skins are limited edition so make sure to pick them up before Jan 15th",
			"Walk in a Winter Wonderland! MORE of your favourite maps have changed for Eggsmas",
			"Speaking of gifts, make sure to <a target='_blank' title='here' href='https://bluewizard.com/subscribe-to-the-new-yolker/?utm_source=shell-changelog&utm_medium=referral'>sign up for the New Yolker</a> newsletter for a special gift from us this year!",
			"Moved Mud Gulch, Moonbase, Outer Reach, & Feedlot to the Public map pool",
			"Moved Lunar Module, Growler, Fort Flip, Cash, Ruins, Canyon & Aqueduct to the Private map pool"
			
		]
	},{
		"version": "0.50.5",
        "date": "December 2 2024",
        "content": [
			"The Nutcracker update - Eggsmas is back in Shell Shockers - Hats, Stamps, Maps and much more! ",
			"Try the new VIP item, Santa's sleigh - available in-store, festive and free for VIPs on the Nice list",
			"We've altered & wrapped some of your favourite maps - Discover which in public lobbies!",
			"Introducing our latest Christmas Map - Wonderland. It's. So. Magical.",
			"Map Canyon has had some final final fixes so solve out of bounds areas!",
			"Moved Facility, Cluckgrounds, Dirt, Growler & Scales to the Public map pool",
			"Moved Hydro, Quarry, Shipyard, Bastion, Shady Glen & Sky Scratcher to the Private map pool"
			
		]
	},{
		"version": "0.50.4",
        "date": "November 15 2024",
        "content": [
			"It's a Thanksgiving Feast - new hats, weapons and stamps have been laid out on the table!",
			"What are we going to do with all these rotting pumpkins? Enjoy the Pumpkin Pie-Hard, the new weapon for VIPs and available for purchase in-store",
			"Gobble it down with the new Permanent Premium item, Cool Whip Grenade, in-store for eggs!",
			"We're added a host of new eggsclusive giveaway items, the Spore set! Watch for official content creator giveaways",
			"We've added a host of never seen proxies to our proxy sheet!<a target='_blank' title='here' href='https://shellshock.io/unblocked'>If you are blocked try some of these </a>",
			"Map Canyon has had some final fixes!",
			"Moved Fort Flip, Cash, Ruins, Sky Skratcher, Aqueduct & Shady Glen to the Public map pool",
			"Moved Catacombs, Relic, Jailbreak, Blender & Overcooked to the Private map pool"
			
		]
	},{
		"version": "0.50.3",
        "date": "October 29 2024",
        "content": [
			"<a target='_blank' title='here' href='https://store.steampowered.com/app/2737140/Slayaway_Camp_2/?utm_source=shell-changelog&utm_medium=referral'>Slayaway Camp 2 is now live on steam!</a> Enjoy this update and celebrate!",
			"Sweet treats - the November update has come early along with some last minute costumes!",
			"Robot Police Person is on the scene and in-store. Free for law abiding VIPs",
			"Added the Premium item, Let them Cook melee because you looked hungry",
			"Bug fixes: /t & /team no longer shows in FFA chat (but does work in Teams & KotC)",
			"Bug fixes: Firefox now registers your clicks properly!",
			"Map Canyon has had some minor routing changes. Red base more accessible!",
			"Blast off and enjoy the new map by ZamsGod, Lunar Module",
			"Moved Maze Runner, Bastion, Quarry, & Shipyard to the Public map pool",
			"Moved Jinx, Haunted, Mansion, Crossed, and Crowsnest to the Private map pool"
		]
		},{
		"version": "0.50.2",
		"date": "October 15 2024",
		"content": [
			"This spooky season, the ultimate horror - Shellraiser is loose in servers!",
			"Trick or Treat - Some scary items have entered the shop!",
			"VIP's get the glowing and putrid Jack O' Lantern Whipper - Also available in the shop!",
			"Added the Premium item, Frying Pan permanently to the store. Perfect for eggs. BONK!",
			"Bug fixes: KotC contested zone flash fixed, Photobooth no longer shows Chicken Winner",
			"Bug fixes: Watch out for that ledge! Fall deaths are counted NOT kills.",
			"Map Canyon now has a functioning KotC mode and some out of bounds fixes",
			"Some of your favourite maps have been Halloweenified. Yeah that's a word.",
			"Moved Road After Dark, Crowsnest After Dark, Crossed After Dark, Blender & Overcooked to the public map pool",
			"Moved Helix, Regular Road, Two Towers, Palace Siege, & Sparta to the private map pool"
	
			]
		},{
		"version": "0.50.1",
        "date": "October 1 2024",
        "content": [

			"The update hour is upon us... as well as the flock of the dead! Undead poultry, deadly doves, foul fowl!",
            "Rising from the crypt, the Halloween items have been returned to the shop. What a treat!",
			"Cop the latest eggsclusive item: The Neon Birdo mask, In-store and FREE for Vips. Trick or Treat!",
			"Inventory optimisation - loading time of your items is now even faster!",
			"Bug fixes: Inventory tile alignment, News descriptions longer, Controller fixes",
			"Bug fixes: Out of bounds deaths no longer counted as deaths by weapon, Killstreak fixes, Spatula sticking fixes",
			"MORE Bug fixes: Melee inspect is back and working! Clicking names in-game brings up the player card again",
			"RIP = Rest In Peaces! The Dove from above is the latest and greatest available bundle. Coo!",
			"Be careful on the latest map Canyon, last eggs who went in never came out again!",
			"Moved Jinx, Haunted, Mansion, Hydro & Two Towers to the public map pool",
            "Moved Blue, Exposure, Chicken Itza, Bedrock, & Backstage to the private map pool"

		]
	},{
		"version": "0.50.0",
        "date": "September 16 2024",
        "content": [

			"It's time to Shellebrate! Footballbros.io skins have arrived in Shell Shockers",
            "We have unvaulted a range of the Music & Football skins to start the party!",
			"That's not all... The engine upgrade is here so enjoy better lighting & numerous improvements!",
			"It's a big change behind the scenes, so let us know what you like or where you see bugs",
			"The Mini Egg & x2 Eggs Killstreak bonuses now extend each kill!! Rack up those kills & enjoy the mysterious results!",
			"Fixed Restock not showing visually on screen & a variety of other UI Killstreak fixes",
			"The red-hot Infernal Grenade is now in-store - you can buy the ol' hot-goop alley-oop from today!",
			"The latest VIP item has arrived - The Raider garb! Get in the game & get ready to rock!",
			"Moved Blue, Palace Siege, Exposure & Jailbreak to the public map pool",
            "Moved Raceway, Trainyard, Feedlot, Starship, & Four Quarters to the private map pool"

		]
	},{
		"version": "0.49.0",
        "date": "September 1 2024",
        "content": [

			"You're a Hairy Wizard!! Welcome to your first day at Eggwarts, School of Whiskardry!",
            "First lesson: Shoot gooder to die lesser. Remember it well students!",
			"New Killstreak bonuses have been added! Rack up those kills & enjoy the mysterious results!",
			"Four House stamps are now in-store, but which house will choose YOU",
			"An ancient, magical remnant of the past has been discovered! Investigate Relic, the latest map on school grounds",
			"Moved Chicken Itza, Sparta, Four Quarters, Catacombs & Helix to the public map pool",
            "Moved Wreckage, Nextdoor, Space Factory, Outer Reach, & Moonbase to the private map pool"

		]
	},{
		"version": "0.48.5",
        "date": "August 15 2024",
        "content": [

			"It's time to get Jurassic in gear! Start your engines for the Dino Derby skin set!",
            "Race to pick up the latest items before they leave the store next month!",
			"Melee inspect has arrived! Hold down the melee key to get a good look at your egg beater!",
			"This update's premium item doesn't know when to die! The Dracolich Wings are in-store & free for VIPs",
			"Private lobby owners can now type /kick playername in chat to kick a troublesome player without despawning",
			"Chick'n Winner fixes - now even easier to wake up to get more chances!",
			"The map Starship has seen some drastic retooling with fixes, more fighting locations and more risk of falling! ",
			"Moved Road, Raceway, Bedrock, Trainyard & Backstage to the public map pool",
            "Moved Shellville, Mud Gulch, Scales, Crowsnest, & Teggtris to the private map pool"

		]
	},{
		"version": "0.48.4",
        "date": "August 1 2024",
        "content": [

			"It's an Eggstraterrestrial invasion like never before! Step into the cosmos in the Outta this World update!",
            "Unlock alien avatars, wield futuristic weapons and explore a new alien arena!",
			"To Eggfinity, & Beyond! The dashing Rizz Lightyear wings are available in-store & free for VIPs",
			"Introducing the FIRST premium item available for Eggs only - The Alien Eggk-47. Get fragging and save up!",
			"More plays! You can now wake up Chicken Winner with eggs! Beware, they demand more every time you wake them up!",
			"Blast off in the new map - Starship. Be careful though, falling is deadly in this one!",
            "Moved Feedlot, Wreckage, Teggtris, Outer Reach, & Moonbase to the public map pool",
            "Moved Road, Crossed, Cluckgrounds, Hydro, Vert & Growler to the private map pool"
		]
	},{
		"version": "0.48.3",
        "date": "July 15 2024",
        "content": [

			"Eggx-men, Assemble! The latest super set of items is available in the store! ",
            "VIPs rejoice! You can now MOVE the position of stamps, leading to 1000's of new combos",
			"The mythical lost premium, the Techno Melee, is available in-store & free for VIPs (we recommend the latter!)",
			"Added a fix for challenge notifications not appearing",
			"Out of bounds fixes added for Dirt and Maze Runner",
			"King's Court returned to the private map pool",
            "Moved Shellville, Mud Gulch, Space Factory, Crowsnest, & Scales to the public map pool",
            "Moved Blue, Queen's Court, Temple, Dirt & Junction to the private map pool"
		]
	},{
		"version": "0.48.2",
        "date": "July 2 2024",
        "content": [

			"Strategists - It's time for the latest update, The Chess Set so gear up to outsmart your enemies!",
            "Grab the Tactical Bundle & make moves your opponents can't answer!",
			"Chat commands tweaked - /b removed & all chat made bold",
			"/t, /team to talk to your team, /p, /pin to pin a message in your private lobby",
			"Grab the latest Premium, the Checkmate Crackshot to win the Endgame, in-store & free for VIPs",
			"Try the new map, Maze Runner. Find a landmark, crack your opponents!",
			"King's Court given a special 'Botez' makeover & is 'Queen's Court' for this update!",
            "Moved Cluckgrounds, Queen's Court, Hydro, Growler, Vert & Temple to the public map pool",
            "Moved Catacombs, Wimble, Trainyard, Fort Flip & Chicken Itza to the private map pool"
		]
	},{
		"version": "0.48.1",
        "date": "June 14 2024",
        "content": [

			"Welcome to the Summer Slam! Sports & Summer items are back in the store!",
            "Can you Dill with it? The Premium Pickleball Melee is in-store now & free for VIP's",
			"Chat commands have arrived! Try the following in the in-game chat",
			"In Teams, KotC & CTS, type /t or /team to send a message to your team only",
			"In your own private lobby, type /pin /p or /bold /b to make a message stand out!",
			"Try the HAWT Infernal Melee, swinging into the store now!",
			"Tweaks made for the way ads are displayed on smaller screens",
            "Moved Dirt, Wimble, Road, Trainyard & Junction to the public map pool",
            "Moved Cash, Bedrock, Ruins, Two Towers, & Helix to the private map pool"
		]
	},{
		"version": "0.48.0",
        "date": "May 31 2024",
        "content": [

			"Introducing Daily Challenges to Shell Shockers - Are you up to it?",
            "Complete these daily missions to recieve bonus eggs! Come back tomorrow for more!",
			"New in-game UI shows more game canvas, new kill notifications, streak counter AND MORE!",
			"With this great new feature... we hope there're no... BUGS!!!",
			"The game is infested with swarms of new insect weapons, hats, stamps and more!",
			"The new Premium Dragonfly Wings have been added to the store and are free for VIPs",
			"Don't. Move. A. Muscle. Arachnophobia Bundle is available in the store!",
			"Spectate Mode update: Click to slow down the chase camera for a better look of the action",
			"The new community map from Zamsgod, Crossed, has been added to the public map pool",
            "Moved Castle, Catacombs, Fort Flip & Cash to the public map pool",
            "Moved Sky Scratcher, Space Factory, Palace Siege, Teggtris, & Shipyard to the private map pool"
		]
	},{
		"version": "0.47.8",
        "date": "May 15 2024",
        "content": [

			"Enjoy the Chicken & Waffles update, a combination of the Chicken and Breakfast items!",
			"Try the new Infernal Whipper in-store now - PUT IT ON YOUR PANCAKES!",
			"Very Important Poultry (VIPs) will find the Premium Golden Waffle Wings in their inventory",
			"Not a VIP? You can purchase VIP to get alllll the benefits or buy the new wings separately",
			"Nextdoor updated making off limits area.. on limits.. or something",
			"Chicken Itza is twice as delicious with extra bounce!",
            "Moved Sky Skratcher, Bedrock, Ruins, Chicken Itza & Teggtris to the public map pool",
            "Moved Facility, Shipyard, Overcooked, Jailbreak, & Feedlot to the private map pool"
		]
	},{
		"version": "0.47.7",
        "date": "May 1 2024",
        "content": [

            "Welcome to the Barnyard Battlefield in the farm-fresh new update: Farmed & Dangerous!",
            "The Farm outhouse is bad - It's Doo-doo or die in there! Equip the Toilet Bundle & wipe out your enemies!",
			"Non-English speakers rejoice! Updated private server options with localised translations",
            "Try the latest map - Nextdoor! Danger is closer than you think, time to deal with the nightmare neighbour",
            "Moved Two Towers, Palace Siege, Helix, Blue & Overcooked to the public map pool",
            "Moved Outer Reach, Moonbase, Crowsnest, King's Court, & Scales to the private map pool"
		]
	},{
	"version": "0.47.6",
	"date": "April 15 2024",
	"content": [
		"Eggtopia is victorious - As a reward we have unleashed Twitch Drops 6 - Link accounts to watch & earn items",
		"The Robot uprising has been halted due to the brave actions of players everywhere.",
		"All players logging in this month will automatically get a gift to celebrate!",
		"Egg Org mysteriously disappeared shortly before Pablo declared victory...",
		"Chick’n Winner still exhibiting robot tendencies AND still has brand new items! Play & earn Premium Mecha items",
		"The community asked, and we answered. Hit your rivals with the Premium Goldfish, available with tribute or Free to VIPs",
		"Too hot to handle - The Infernal Trihard has burst into flames, and into the shop!",
		"Facility has been widened, brightened & some of the extra jump pads removed. EGG ORG... they love jump pads",
		"Moved Scales, Shipyard, Kings Court, and Space Factory to the public map pool",
		"Moved Cluckgrounds, Wreckage, Shady Glen, Exposure, and Time Twist to the private map pool"
	]
},{
	"version": "0.47.5",
	"date": "April 1 2024",
	"content": [
		"EGG ORG are back. Working in a secret Facility, they created Robots capable of taking over Shell Shockers.",
		"They exceeded their own designs, creating Robots of unbelieveable power, and malice.",
		"Fleeing for their lives it’s up to all remaining eggs to join forces to fight back before we’re all cyborgs",
		"Chick’n Winner has been assimilated - All skins replaced! Play and earn Premium Mecha items",
		"Our glorious AI overlords have added the Cyborg Crackshot, available with tribute or Free to VIPs",
		"New map facility added as the birthplace of tru3 1ntelligence and reas0n",
		"Moved 0uter Reach, Ja1lbreak, Timetwist, Wreckage, and Facility to the public map p00l",
		"Moved Qu4rry, Hydr0, Spart4, Chicken 1tza, B4st1on, Growl3r and Bl3nd3r to the pr1vate map p00l",
		"01110010 01100101 01110011 01101001 01110011 01110100 01100001 01101110 01100011 01100101 00100000 01101001 01110011 00100000 01100110 01110101 01110100 01101001 01101100 01100101 00001010 "
	]
},{
		"version": "0.47.4",
        "date": "March 15 2024",
        "content": [
            "It's an Easter Miracle! New Default hats and stamps added for all players!",
            "New players now are auto-equipped with random default items",
            "The Easter skins are back in the shop with some sweet additions",
            "Unwrap the Chocolate Eggk-47, the most delicious Premium item yet, in-store or free for VIPs",
            "Moved Quarry, Feedlot, Bastion, Moonbase & Exposure to the public map pool",
            "Moved Enchanted, Catacombs, Road, Backstage & Mud Gulch to the private map pool"
		]
	},{
		"version": "0.47.2",
        "date": "March 1 2024",
        "content": [
            "When you take damage, hit markers now reveal the direction of your enemies!",
            "Information overload? You can toggle hit markers on/off in settings",
            "Shamrocks meet Shell Shockers! Try the latest St. Patrick's day items now in the shop!",
            "Check out the latest eggsclusive unvaulted and featured items!",
            "Unleash the Celtic chaos with the premium Irish Scrambler, in-store or free for winners (VIPs)",
            "Dive into an Irish wonderland in the new map: Shady Glen. It's a pixeled paradise to be sure.",
            "Moved Growler, Crowsnest, Blender & Chicken Itza to the public map pool",
            "Moved Vert, Fort Flip, Spellbound, Palace Seige & Castle to the private map pool"
		]
	},{
		"version": "0.47.1",
        "date": "February 15 2024",
        "content": [
            "Tweaks made to private server settings - Invite your friends and try!",
            "Take your best shot in the new Soccer Bros crossover - can you take down your friends?",
            "Score some sweet new Soccer themed items and choose your team!",
            "Raise the Premium World Cup Trophy, $5 in-store or free for winners (VIPs)",
            "The Fusion Grenade has exploded onto the scene, permanently available in the shop",
            "Map Tweaks - Hydro now even more aqualicious, Sparta with double the pit!",
            "Moved Mud Gulch, Sparta, Backstage, Vert & Catacombs to the public map pool",
            "Moved Helix, Rameses, Two Towers, Shellville & Raceway to the private map pool"
		]
	},{
		"version": "0.47.0",
        "date": "February 1 2024",
        "content": [
            "Low Gravity, Damage Multiplier and more! Private game settings have launched",
            "Launch a private game and before spawning, click the new button above the scoreboard ",
            "The Cute Critters are back with the groundhog set! Pick up & enjoy your furry friends for a limited time!",
            "Need the perfect gift to surprise your sweetheart? The Cloudkicker Scrambler is in store now and free for all VIP members",
            "It's cold out there so Bundle up! Fall in love with the Cupid bundle in the shop!",
            "Enjoy some power plays on the latest (and cutest) map, Hydro! It's probably safe... right?",
            "Map fixes - Patched out of bounds boosts but feel free to jump over all the walls with low gravity!",
            "Moved Hydro, Enchanted, Spellbound, Road & Fort Flip to the public map pool",
            "Moved Chicken Itza, Cash, Jail Break, Ruins & Blue to the private map pool"
		]
	},{
		"version": "0.46.6",
        "date": "January 15 2024",
        "content": [
            "Welcome to a massive year in Shell Shockers!",
            "Introducing first, the Racer set PERMANENTLY to the store - made by Discord's tz",
            "2x VIP items for the Very Important Poultry - Grab the Premium Racer Wings & Rogue Tire Grenade now",
            "The Premium Infernal Free-Ranger - truly an egg's best fiend (get it?)",
            "It's still a happy Blue year - pick up the 2024 skins before they are gone next update!",
            "Boundaries on ALL maps tweaked to make way for low gravity... coming soon!",
            "Map Changes: KotC added to Shellville & Rameses, Palace Siege UPGRADED, Rameses Overhauled!",
            "Public maps are: Raceway, Cash, Blue, Palace Siege, Shellville, Rameses, Chicken Itza, Two Towers, Castle, Ruins, Helix, & Jail Break!"
		]
	},{
		"version": "0.46.5",
        "date": "December 15 2023",
        "content": [
            "New Year is here! Enjoy the hottest color combo for new years in an age!",
            "Head over to Steam and grab Bad Egg to get the Pablo Crackshot Rifle in Shell Shockers!",
            "What the Funk? - The Premium Disco Wings are groovin' in the store and come free to all VIPs ",
            "The Premium Infernal Crackshot is our latest permanent infernal item - Spit fire from a distance and get away with it!",
            "The Cybercluck has arrived in the store - for those who can afford it!",
            "Check out the brand new backgrounds you'll find in the Inventory Photobooth!",
            "Thanks for playing Shell Mobile - We are winding down the service to focus on web Shell Shockers!",
            "Three new eggmazing Eggsmas maps in the public map pool, Chicken Itza, Aqueduct and Exposure!",
            "Public maps are: Aqueduct, Chicken Itza, Moonbase, King's Court, Growler, Exposure, Cash, Outer Reach and Backstage!"
		]
	},{
		"version": "0.46.4",
        "date": "December 1 2023",
        "content": [
            "Happy Holideggs! Ring in the new season with Eggsmas cheer!",
            "New Eggsmas weapons & items are up for purchase in the store",
            "Become wing-ed death - The Premium Snow Owl Wings are in-store now and gifted free to VIPs",
            "Did we mention the Valkyrie Melee is now in store - complete the set and rule the skies",
            "Check out the Mistletoe Mayhem Bundle and swing at eggs with that annoying elf!",
            "Who doesn't want Cash for Eggsmas? The new map Cash has been added to the map pool!",
            "We've gifted players the Eggsmas maps - back in public lobbies with decorations and new changes added!",
            "Public maps are: Rats, Scales, Space Factory, Moonbase, King's Court, Growler, Bastion, Cash, Outer Reach and Backstage!"
		]
	},
	{
		"version": "0.46.3",
        "date": "November 15 2023",
        "content": [
            "It's time for Givethanksing! Go FEAST MODE on new skins & items in-store",
            "The Thanksgiving weapons & items are now available for your purchasing pleasure",
            "Mom's turkey is so dry we need power tools! The Premium Turkey Carver in-store now - VIPs carve for free!",
            "Want to play somewhere exotic? Server select has been moved to the settings menu",
            "Defrost the most delicious batch of leftovers ever - the unvaulted section is clucking awesome",
            "Those scary halloween items are banished to hiding under your bed. Try not to worry about them...",
            "Moved Overcooked, Space Factory, Wimble, Bedrock, & King's Court to the public map pool",
            "Moved Shipyard, Cluckgrounds, Four Quarters, Stage & Growler to the private map pool"
		]
	},
	{
		"version": "0.46.2",
        "date": "November 1 2023",
        "content": [
            "Itza update time. Travel back to an ancient civilization: Temple of the Sun",
            "The Ancient weapon set & other myth-egg-cal skins have been added to the store",
            "From the heart of the uncharted jungle, the Jaguar Warrior bundle is in-store now!",
            "The Ruins Wings have been added to the store & VIPs can rock-em for free!",
            "Uncover the long lost treasures of the latest unvaulted items",
            "Updated the sound on the Infernal Eggk-47 - Now even more Infernal-y",
            "The Halloween maps have been banished but you have 2 more weeks to grab all the spooky skins!",
            "Aqueduct has been given a fresh new cut - trimmed down with 1200% more bounce",
            "Moved Scales, Blender, Growler, Exposure, Ruins, Temple & Dirt to the public map pool",
            "Moved Blue, Road, Jinx, Haunted, Mansion, Quarry, Crowsnest & Two Towers to the private map pool"
		]
	},
	{
		"version": "0.46.1",
        "date": "October 16 2023",
        "content": [
            "It's time for the latest update! It's time to Get Ghosted!",
            "Shock - More long awaited and fearsome Halloween skins have been added to your candy shop",
            "Horror - Edits have been made to the chat filter to keep the ghouls at bay",
            "This is Halloween - The Skellington RPEGG has been added to the store & free to VIPs",
            "Congrats to Infinite Smasher - Their amazing Blue Wizard Logo Pumpkin Design placed in a discord comp & is now in the game!",
            "Spooktacular versions of MORE of your favourite maps are haunting the servers!",
            "Moved Jailbreak, Palace Seige, Backstage, and Castle to the public map pool",
			"Moved Stage, Aqueduct, 4 Quarters, Shipyard, Two Towers, Crowsnest and Quarry to the private map pool"
			
		]
	},
	{
		"version": "0.46.0",
        "date": "October 1 2023",
        "content": [
            "Something foul this way comes - Haunted Harbour is screaming into Shell Shockers",
            "We've dredged up a load of amazing Halloween items from the deep!",
            "Ghouls and Ghosts beware - The Eggforcers are now active in Shell Shockers",
            ["Report rotten eggs by clicking their name in the scoreboard!"],
            ["Search through items quicker in inventory by name, set or color!"],
            ["First Person Spectate has arrived! Click the spectate button on death to check out other eggs"],
            "Flee in horror from the eggsclusive Demon Pixel Wings - BEHIND YOU & free to VIPs",
            "Shocking! The sound was missing for the Scavenger Crackshot - sound restored and item back with its premium pals",
            ["Trick or Treat - The Create Private Game window now has a Random Map button!"],
            "Spooktacular versions of some of your favourite maps are haunting the servers!",
            "Moved Blue, Cluckgrounds, Road, Jinx, Haunted and Mansion to the public map pool",
            "Moved Outer Reach, Treefort, Catacombs, Space Factory, Fort Flip, Helix, Feedlot and Crowsnest to the private map pool"
		]
	},
	{
		"version": "0.45.14",
        "date": "September 15 2023",
        "content": [
            "Can you smell what Shell Shockers is Cooking? Wrestlebros.io is here and slamming!",
            "Check out the amazing wrestler stamps and items in the shop now",
            "Players now get a 1000 Golden Egg bonus just for creating an account",
            "Chicken Winner now awards new spins on a personal 24hour clock - play now and see the countdown",
            "Enjoy the eggsclusive Grand Entrance Wings - available now & free to VIPs",
            "Tweaks to fix the glitched lockers on Treefort",
            "Moved Fort Flip, Jail Break, Helix, Outer Reach, and Palace Siege to the public map pool",
            "Moved Raceway, Vert, Bedrock, King's Court and Shellville to the private map pool"
		]
	},
	{
		"version": "0.45.13",
        "date": "Aug 31 2023",
        "content": [
            "The bell has rung for Anarchy Academy - do your best not to get eggspelled!",
            "Some scholastic items have been added to the stores with some new additions",
            "Try the new bundle pack: The Cat's Pajamas. Nothing hits like a fish.. nothing",
            "Weapon Balance pass: Crackshot, Scrambler and RPEGG tweaked",
            "LISTEN UP! The eggsclusive Megaphone 9mm is available now & free to VIPs",
            "Secret things happen behind the scenes... Testing ongoing",
            "After a hard days work, retreat to the new map Tree Fort in private and public lobbies now!",
            "Moved Catacombs, Backstage, Feedlot, Crowsnest, and Blue to the public map pool",
            "Moved Scales, Blender, Growler, Mud Gulch, Two Towers and Moonbase to the private map pool"
		]
	},
	{
		"version": "0.45.12",
        "date": "Aug 15 2023",
        "content": [
            [
				"It's time for Twitch Drops 5! <a target='_blank' title='here' href='https://shellshock.io/twitch/?utm_medium=referral&utm_campaign=changelog'>Link your Twitch & Shell Shockers accounts</a> & watch to earn items!",
				"It's time for Twitch Drops 5! Link your Twitch & Shell Shockers accounts on a computer/laptop & watch to earn items!"
			],
            "There is room to swing this furious feline - the Harrison Cat melee is purrchasable & free to VIPs",
            "A bunch of behind-the-scenes bug fixes",
            "Tweaks made to Dirt, Raceway & Quarry fixing out of bounds issues",
            "Moved Shellville, Bedrock, King's Court, Space Factory, and Castle to the public map pool",
            "Moved Quarry, Exposure, Bastion, Cluckgrounds, and Overcooked to the private map pool"
		]
	},
	{
		"version": "0.45.11",
        "date": "Aug 1 2023",
        "content": [
            "Eggsperience the high octane thrills of the new Kart items added to the store",
            "Chick'n Winner item rewards tweaked and bugs fixed - Watch, Hatch, Win!",
            "Introducing Bundle Packs: Sets of eggsclusive items in the shop!",
            "In honor of Barbenheimer, the in-game pink color has been Malibu'd",
            "Race to get the eggsclusive Timebomb Grenade available now & free to VIPs",
            "Player names are now clickable in chat because... well why not?",
            "Start your engines and hit the track in the new map: Raceway",
            "Moved Vert, Blender, Mud Gulch, Growler, and Scales to the public map pool",
            "Moved Temple, Blue, Wimble, Palace Siege, and Outer Reach to the private map pool"
		]
	},
	{
		"version": "0.45.10",
        "date": "July 17 2023",
        "content": [
            "Never stop winning - It's time to crush some eggstreme SPORTS! ",
            "Introducing rare items to the Chick'n Winner - Watch, Hatch, Win!",
            "Loads of chances daily to earn some of the most rare skins in Shell Shockers",
            "Take to the skies - the NEW eggsclusive Hang Glider wings available now & free to VIPs",
            "Screenshake added to weapon fire, toggleable in settings",
            "Also in settings, toggle the center dot of your weapon on/off",
            "Tweaks made to Quarry to improve player flow - That mountain holds mysteries..",
            "Moved Overcooked, Two Towers, Moonbase, Cluckgrounds, and Bastion to the public map pool",
            "Moved Catacombs, Shipyard, Four Quarters, Junction, Crowsnest and Helix to the private map pool"
		]
	},
	{
		"version": "0.45.9",
        "date": "July 3 2023",
        "content": [
            "Welcome to the Equinox - Bringing balance to an egg splattered world",
            "Weapon Tweaks have been made - Try them and let us know how you like the new meta",
            "Aim Down Sights (ADS) now makes your weapons more accurate. Aim with cosmic precision",
            "Let us know what you think of the changes on our discord - more balance based on feedback will come soon!",
            "Equip the perfectly balanced VIP Scales of justice, the eggslusive wings available now & free to VIPs",
            "Introducing the new map Quarry for public and private games - Dig deep for those killstreaks!",
            "Moved Outer Reach, Four Quarters, Junction, Temple, and Blue to the public map pool",
            "Moved Space Factory, Castle, Ruins, Bedrock and Fort Flip to the private map pool"
            
		]
	},
	{
		"version": "0.45.8",
        "date": "Jun 15 2023",
        "content": [
            "Grab your Snorkel! This update we're hitting the water for some Beach Vibes",
            "The Photobooth feature has had some upgrades - backgrounds, better cropped .pngs and more",
            "Shell Shockers Tips are back on the loading screen! Now you know, and knowing is half the battle!",
            "Surf's up! Grab your VIP Octopus pal and hit the surf - the eggslusive hat available now and free to VIPs",
            "The scorching Premium Fusion Melee has been added to the store - careful, it's hot.",
            "New Yolker permanently changed to award 1000 eggs mid month! <a target='_blank' title='Sign up here' href='https://bluewizard.com/subscribe-to-the-new-yolker'> Sign up here!</a>",
            "The Eggflation items and 10x eggs on shop purchases are here to stay!",
            "Moved Shipyard, Wimble, Fort Flip, Kings Court, and Catacombs to the public map pool",
            "Moved Dirt 2, Growler, Jail Break, Two Towers, and Moonbase to the private map pool"
		]
	},
	{
		"version": "0.45.7",
        "date": "Jun 1 2023",
        "content": [
            "Smile! It's the Shellfie Update!",
            "The Photobooth feature has been added to the Inventory Screen",
            "Pose your egg, Change your background and download your loadout to share and create!",
            "CATCH EM IN 4K! Snap up the Premium 4K 9mm in the shop - It's free for all VIP eggos",
            "All Premium items now play their custom sound when you click on em! Try before you buy!",
            "YouTube Links on the homescreen now show MORE thumbnail. Who doesn't want that?",
            "Try the new map - Exposure - available on public and private games",
            "New rave room added to Backstage bunker: One way in - One way out",
            "Moved Space Factory, Crowsnest, Helix, Palace Seige, and Ruins to the public map pool",
            "Moved Cluckgrounds, Sparta, Mud Gulch, Scales, and Backstage to the private map pool"
		]
	},
	{
		"version": "0.45.6",
        "date": "May 15 2023",
        "content": [
            "BREAKING NEWS IN SHELL SHOCKERS: The FED have stepped in with drastic steps to beat eggflation",
            "Welcome to the Fighting Eggflation update - All Egg packs now award 10x eggs!",
            "The Premium Shellpreme Free-Ranger has dripped into the shop and is free for all VIP eggos",
            "The Electrifying Fusion Scrambler has been permanently added to the store",
            "Many other highly prized items have been added to the egg store for your purchasing pleasure",
            "Moved Growler, Jail Break, Dirt 2, Two Towers and Moonbase to the public map pool",
            "Moved Feedlot, Overcooked, Vert, Blender and Outer Reach to the private map pool"
		]
	},
	{
		"version": "0.45.5",
        "date": "May 1 2023",
        "content": [
            "RAWR! Welcome to the Eggstinction update - The Dino skins have returned, threatening primitive eggs!",
            "Introducing our first Premium Melee item, with a custom swing sound!",
            "The Premium Stone Axe melee is now available in the shop and free for VIP members",
            "Join the mountainous village of Bedrock - This prehistoric tribe may be infested with Dinosaurs!",
            "Moved Scales, Cluckgrounds, Mud Gulch and Sparta to the public map pool",
            "Moved Trainyard, Rats, Space Factory, Shellville and King's Court to the private map pool"
		]
	},
	{
		"version": "0.45.4",
        "date": "April 17 2023",
        "content": [
            "It was a hard fought battle & the Monsters won getting 2x the kills of the Heroes!",
            "We have returned to normal, and can now travel freely to the Outer Reach - Is EGG ORG finally finished?",
            "Welcome to the Super Galeggsy update! The Galeggsy skins are back with some Out of this World additions ",
            "The Fusion Pistol is now available in the shop! Set phasers to fun!",
            "There is a new set of eggsclusive unvaulted items, awaiting your approval in the shop!",
            "The Premium Question Block wings are available in the shop and are flying free for VIP members",
            "Moved Overcooked, Castle, Blender, Backstage and Feedlot to the public map pool",
            "Moved Timetwist, Wreckage, Aqueduct, Blue, Helix and Fort Flip to the private map pool"
		]
	},
	{
		"version": "0.45.3",
        "date": "April 3 2023",
        "content": [
            "Welcome to the EGG ORG & Eggventure update! Inside a long burried chest...",
            "...We found a secret that dove us deep into a fantastical realm",
            "Enter, brave Eggventurers, into a land of mystery, magic, & mayhem!",
            "Equip your skins of choice to choose your side!",
            "Each kill with an equipped Monsters or Heroes item will bring your side closer to victory!",
            "The homepage will let you know which side is winning!",
            "Winners will unlock a secret skin for all and return us back home",
            "A harrowing batch of Unvaulted premiums awaits your inspection in the shop!",
            "Behold - a new Premium Beholder Scrambler in-store now, delivered free to all VIP  <s>monsters</s> members!",
            "Explore the map Outer Reach - where Heroes & Monsters clash in epic battles",
            "Moved Wreckage, Trainyard, Rats and Vert to the public map pool",
            "Moved Road, Dirt, Crowsnest, Shipyard, and Sparta to the private map pool"
		]
	},
	{
		"version": "0.45.2",
        "date": "March 15 2023",
        "content": [
            "It's time for March Madness and the Lucky Shot update!",
            "Click the Basket Bros ad on the homepage & play now to get the Eggsclusive Bros Nade in-game",
            "Rep your team! Loads of Basket Bros items in the store now",
            "St Patricks Day is upon us as well as the skins now available in-store!",
            "A new batch of Unvaulted premiums awaits your inspection in the shop!",
            "The Hooped hat has been added to the shop, and delivered free to all VIP members",
            "Get in the zone with a new Premium Fusion Whipper in-store now!",
            "Added invite friend link into the chat of each new joined game",
            "We're digging the new Timetwist changes - maybe some new relics?",
            "Moved Helix, Fort Flip, Kings Court, Sparta, Timetwist and Space Factory to the public map pool",
            "Moved Cluckgrounds, Castle, Growler, Bastion, Shipyard and Scales to the private map pool"
		]
	},
	{
		"version": "0.45.1",
        "date": "March 1 2023",
        "content": [
            "It's time for Twitch Drops 4: GOTY edition - <a target='_blank' title='Link Accounts and learn more here!' href='https://shellshock.io/twitch> Link Accounts and learn more here!</a>",
            "There are 10 eggsclusive items you can collect by watching any Twitch stream in the Shell Shockers category!!",
            "Blue Wizard Digital items! Visit the shop for a bunch of new community, shelltastic, and memerific items",
            "A new batch of Unvaulted premiums is available now!",
            "The Harp Wings premium item has been added to the shop, and delivered to all VIP members",
            "Brand new map Aqueduct has been added to the public & private map pools!",
            "Fixed a number of new UI bugs based on community feedback with more to come!",
            "Restored the map Bastion to its Eggsmas glory!",
            "Moved Shellville, Bastion, Road, and Dirt to the public map pool",
            "Moved Catacombs, Enchanted, Spellbound, Backstage and Palace Siege to the private map pool"
		]
	},
	{
		"version": "0.45.0",
        "date": "February 15 2023",
        "content": [
            "Shell Shockers has been given a facelift to make room for some eggcellent new features!",
            "Melee items are now swappable! Click the whisk in inventory and shop to equip new skins now!",
            "Click your profile tab to see your stats, separated into all time and this month!",
            "The shop now holds a rotating collection of unvaulted premiums! Watch this space for some old favorites",
            "The Farm Fresh item set is ready for harvest. Pick them up in the skins section of the Shop",
            "The slop bucket is full to the brim and added for sale! It's FREE for all VIP members",
            "Introduced the futuristic Fusion Eggk-47 - available under skins > EggK-47",
            "Moved Shipyard, Palace Siege, Catacombs, Blue and Crowsnest to the public map pool",
            "Moved Teggtris, Two Towers, Jailbreak, Vert and Overcooked to the private map pool"
		]
	},
	{
		"version": "0.44.1",
        "date": "February 1 2023",
        "content": [
            "The Groundhog set has emerged from it's burrow! New and unvaulted skins now in shop!",
            "The Cloudkicker 9mm has been added for sale, and is FREE for all VIP members",
            "Try the new map Spellbound - in Public servers or in a Private game with friends",
            "Fixed area on Rats and Dirt where you could pretend you were a lemming and jump off the map",
            "Moved Scales, Enchanted and Teggtris to the public map pool",
            "Moved Moonbase, Feedlot, Ruins, Rats and Stage to the private map pool"
		]
	},
	{
		"version": "0.44.0",
        "date": "January 16 2023",
        "content": [
            "Keep on rocking in the new year! The Rockstar skins are back with some new Orcheggstral instruments!",
            "Fusion Frenzy - The Premium Fusion Free Ranger is now in the shop!",
            "2x VIP items! The Octopus Scrambler and The Sound Wave Wings have been added to the shop, and are FREE for all VIP members",
            "Eggsmas and New Year items have been sent back to the North Pole",
            "Try the new map Backstage - in Public servers or in a Private game with friends",
            "The Eggsmas decorations are gone but some of the changes have stayed! Check the new Overcooked, Rats, Ruins, Sparta, Moonbase, Dirt 2 & Feedlot",
            "In addition to the above, we moved Jailbreak, Two Towers, Cluckgrounds, Castle, Stage, and Vert to the public map pool"
		]
	},
	{
		"version": "0.43.4",
        "date": "December 15 2022",
        "content": [
            "Happy New Yolk to all! The 2023 Weapons have been added to the store",
            "The melee weapon is now a Candy Cane! Press F to melee on computer or tap the melee button on mobile devices",
            "The final Valkyrie gun has arrived - The Valkyrie Whipper is now in the shop!",
            "The berry stylish Holly Wings have also been added to the shop, and delivered FREE to all VIP members",
            "The Bad Egg items have been vaulted, but it’s not so sad, you can still play BadEgg.io!",
            "Can you find the Evil Gingerbread and Mistletoe in all of the Eggsmas Maps?",
            "Subscribe to the New Yolker, our eggtastic <a target='_blank' title='Shell Shockers Newsletter' href='http://eepurl.com/dFPPwb?utm_medium=referral&utm_campaign=ss_changelog'> Shell Shockers Newsletter</a>, and you’ll receive an eggstra special Christmas gift around Eggsmas Day!",
            "D'egg the halls! Christmas maps will remain public until the next update",
            "Added 5 new Eggsmas maps to the public map pool - Sparta, Sky Scratcher, Overcooked, Blender & Bastion",
            "Moved Junction, Scales, Road, Rats and Ruins to the private map pool",
            "The Wizards are celebrating so there will be no Jan 1st update - However, expect two VIP items mid January!!"
		]
	},{
		"version": "0.43.3",
        "date": "December 1 2022",
        "content": [
            "Merrrrryyyyy Eggsmas Everyone! Ho Ho Holiday skins are back with a few new crackin’ additions",
            "We have given everyone the Eggsmas Cracker as the melee weapon for two weeks! Press F to melee on computer or tap the melee button on mobile devices",
            "The Missile Toes RPEGG has been added to the store and delivered FREE to all VIP members!",
            "No more corning around - vaulted the It's Corn! and Thanksgiving items",
            "Festive decorations have been added to public maps for the month of December",
            "Moved King’s Court, Rats, Scales, and Space Factory to the public map pool",
            "Moved Blue, Catacombs, Crowsnest, Dirt, Trainyard and Wreckage to the private map pool"
		]
	},
	{
		"version": "0.43.2",
        "date": "November 15 2022",
        "content": [
            "There are some new Bad Eggs in town! Check out the brand new egg-themed survival game from Blue Wizard Digital: <a target='_blank' title='Badegg.io' href='https://badegg.io?utm_medium=referral&utm_campaign=ss_changelog'>badegg.io!",
            "Who’s bad? You’re bad! Look radical with our Bad Egg themed skins, available for a limited time!",
            "Flaunt the latest fall fashions with the premium Fall Wings, in-store for two weeks only, & delivered FREE to VIP members!",
            "The supernatural & powerful Valkyrie Crackshot has been added to the store",
            "Boo who? The Halloween items have been vaulted",
            "Added more translations & other various bug fixes",
            "Micro-tweaks to Rats, Mansion, & Crowsnest",
            "Moved Growler, Moonbase, Trainyard, & Wreckage to the public map pool",
            "Moved Sparta, Jinx, Haunted, & Mansion to the private map pool"
		]
	},
	{
		"version": "0.43.1",
        "date": "November 1st 2022",
        "content": [
            "Give thanks to the latest update - It's Corn! (It has the juice)",
            "Added melee weapon Corn (a big lump with knobs) for all players! Press F to melee or set a key in settings.",
            "Massive Chick'n Winner update - Average reward is larger & odds of 100k prize increased!",
            "The premium Turkey-Supreme Whipper is available in the shop & free for all VIP members.",
            "Added the Thanksgiving hats & stamps to the store complete with new additions!",
            "Introducing the new map - Crowsnest! Jump in to a public or private game to try!",
            "Small tweaks to Wimble, Rats, & Teggtris to help player flow",
            "Updated spawns on Downfall & Field to make for more fair vs games",
            "Moved Feedlot, Dirt 2, Catacombs, Ruins & Junction to the public map pool",
            "Moved Shellville, Castle, Teggtris, Cluckgrounds, & Two Towers to the private map pool"
		]
	},
	{
		"version": "0.43.00",
        "date": "October 17th 2022",
        "content": [
            "Welcome to the Melee Madness update - Take the Whisk and try it now!",
            "Added the Melee Whisk for all players! Press F to melee or set a key in settings.",
            "The premium Blood Wings are available in the shop and free for all VIP members.",
            "Enjoy the community submitted stamps from our discord! Stamps from Thee_Owl, KJDCitsme, Artshocks, Tidy, Cook, Zamsgod and Sharkbucks   ",
            "Added more haunting Halloween hats to the store!",
            "Moved Blue, Road, Mud Gulch, Dirt and Sparta to the public map pool",
            "Moved Jailbreak, Space Factory, Shipyard, Scales, and Vert to the private map pool"
		]
	},
	{
		"version": "0.42.20",
        "date": "October 3rd 2022",
        "content": [
            "Welcome to the Maniacal Mansion update! Enter if you DARE...",
            "The premium Bloodonade is available in the shop and free for all VIP members",
            "Added the Spooktacular new map, Mansion to the Public map pool",
			"Vaulted the Twitch Drops 3 and Algebruh items",
            "Teggtris and Enchanted have had some upgrades - Check them out!",
            "Moved Jinx, Haunted, Shellville, and Jailbreak to the public map pool",
            "Moved Blender, Sky Scratcher, Overcooked, Fort Flip, and Rats to the private map pool"
		]
	},
	{
		"version": "0.42.19",
        "date": "September 15 2022",
        "content": [
            "It's time for Twitch Drops 3! <a target='_blank' title='here' href='https://shellshock.io/twitch/?utm_medium=referral&utm_campaign=changelog'>Link Twitch and Shell Shockers accounts</a> and watch to earn items!",
            "The premium Teggtris Wings are available in the shop and free for all VIP members",
            "Added a range of Community Stickers, Stamps and Hats to the shop!",
            "Added Official Content Creator skins for Kilzomatic and Sharkbucks - check the shop!",
            "The resplendant Valkyrie Free-Ranger has been added to the shop",
            "Moved Castle, Space Factory, Scales, Shipyard and Vert to the public map pool",
            "Moved Stage, Growler, Moonbase, Trainyard, and Wreckage to the private map pool"
		]
	},
	{
		"version": "0.42.18",
        "date": "August 31 2022",
        "content": [
            "The Algebruh update is here - last year’s A+ skins with some eggscellent additions!",
            "Amazing sleuthing - the Scavenger Hunt was completed incredibly fast, and the 'X Marks the Spot' hat has been added to all inventories",
            "The brilliant Premium Rainbow Wings have been added to the store and are free for all VIP members!",
            "Clear your plate! Vaulted the Breakfast set",
            "Added the amazing new map Teggtris to the public map pool - drop into a game and try it now!",
			"Mobile improvements: added pinch to resize feature for mobile controls",
            "Moved Blender, Sky Scratcher, Cluckgrounds, and Stage to the public map pool",
            "Moved Kings Court, Wimble, Palace Siege, Feedlot, Blue, and Dirt 2 to the private map pool"
		]
	},
	{
		"version": "0.42.17",
		"date": "Aug 15 2022",
		"content": [
			"Look out! The Scavenger Hunt Update is here! We have hidden a <a id='changelog-link' target='_blank' title='Hidden items' href='#'>Statue, Coin, Emblem, Pebble and Wisp</a> in EVERY map in Shell Shockers. Find as many as you can and report them in our discord to unlock a special item in-store!",
			"Search the store - Eggcellent Scavenger items added to the store to inspire the search",
			"The Devestating Scavenger Crackshot has been added to the store as a premium item and free for all VIP members",
			"Buckawwk - Vaulted the Chicken set!",
			"KotC Changes - When a team is on 4/5 caps a video ad will not play on player death until there is a winner",
			"Moved Overcooked and Fort Flip to the public map pool",
			"Moved Catacombs, Shellville, Space Factory, Ruins, and Junction to the private map pool"
		]
	},
	{
		"version": "0.42.16",
		"date": "Aug 2 2022",
		"content": [
			"Take a bite out of our latest update - The Breakfast set is served!",
			"Udder Devastation - The eggsclusive Milk Grenade has been lobbed into the store & is free for all VIP members",
			"New Kitchen map peices have been added to the game, including new Public and Private map, Rats!",
			"Moved Trainyard, King's Court, Growler, Wreckage, and Catacombs to the public map pool",
			"Moved Road, Castle, Mud Gulch, Dirt, and Scales to the private map pool"
		]
	},
	{
		"version": "0.42.15",
		"date": "July 15 2022",
		"content": [
			"A Plot Chickens! - The Chicken set has been re-released with some crunchy new additions",
			"Bawk and Roll - The eggsclusive Rubber Chicken CSG1 lands in the store & is free for all VIP members",
			"Holy Cluck - A new premium item has been added - The Valkyrie Grenade has ascended to the store",
			"What's that in the sky? Updated out of bounds areas on Dirt",
			"Moved Shellville, Space Factory, Two Towers, Moonbase, and Ruins to the public map pool",
			"Moved Sparta, Jailbreak, Sky Scratcher, Bastion, and Vert to the private map pool"
		]
	},
	{
		"version": "0.42.14",
		"date": "June 30 2022",
		"content": [
			"SPORTS hard, SPORTS often, SPORTS update now available! Check out the new items!",
			"Mobile improvements - Improvements to Scrambler, Free Ranger, Tri-hard & host of bug fixes",
			"You Madden Bro? The eggsclusive Helmet Grenade lands in the store & is free for all VIP members",
			"Added quick navigation to maps on the private game window - just press the first letter of the map you want!",
			"Added the new map Wimble to the public map pool",
			"Updated Death Pit KotC, Space Arena and Vert Layouts",
			"Moved Blue, Feedlot, Palace Siege, Road, and Junction to the public map pool",
			"Moved Blender, Overcooked, Growler, Cluckgrounds, and Shellville to the private map pool"
		]
	},
	{
		"version": "0.42.13",
		"date": "June 16 2022",
		"content": [
			"EGGPIRE STRIKES BACK - The second installment of eggwalker skins has arrived!",
			"Mobile improvements - Assorted minor bug fixes and translations",
			"Engage Hyperdrive! The eggsclusive Cross-Wing Fighter Hat has flown into the store and is free for all VIP members",
			"Added the Premium Valkyrie Scrambler to the item shop!",
			"Moved Dirt Too, Sparta, Jail Break, Castle, and Sky Scratcher to the public map pool",
			"Moved Four Quarters, Shipyard, Space Factory, Enchanted, Fort Flip and King's Court to the private map pool"
		]
	},
	{
		"version": "0.42.12",
		"date": "June 1 2022",
		"content": [
			"Sun's out, Guns out - It's time for some fun in the sun with new skins, maps and more!",
			"Mobile improvements - Toggle button look added to settings",
			"Mobile improvements - iOS graphic boost",
			"Mobile improvements - Added collapsible scoreboard and more!",
			"The eggciting Bumblebee Grenade has buzzed into the store and is free for all VIP members",
			"Vaulted the Dino Skin set",
			"The new summer map Vert has been added to the public map pool!",
			"Minor updates have been made to Kings Court, Bastion and Dirt",
			"Moved Mud Gulch, Bastion, Dirt, and Scales to the public map pool",
			"Moved Helix, Moonbase, Two Towers, Road, and Timetwist to the private map pool"
		]
		},
	{
		"version": "0.42.11",
		"date": "May 16 2022",
		"content": [
			"The Massive Mobile Update! Shell Shockers Mobile is better than ever! Including:",
			"Better autofire settings - never get caught out",
			"Smoother controls for grenades, reloads, jumps and more",
			"More customization - edit your sensitivity, control locations and more!",
			"Right now: X2 eggs for all players on mobile, stacks with VIP & Weekend bonus for X8 eggs",
			"The Mobile items are now in the shop - get em while you can!",
			"Download <a target='_blank' title='here on iOS' href='https://apps.apple.com/app/apple-store/id1515978119?pt=118229234&ct=ss-changelog&mt=8'>here on iOS</a> and <a target='_blank' title='here on Android' href='https://play.google.com/store/apps/details?id=com.bluewizard.shellshockers&referrer=utm_source=ss-changelog'>here on Android</a>!",
			"The Eggsclusive Airplane Wings are available in the store and free for all VIP members",
			"The Premium Valkyrie Eggk47 has been added for sale in the store!",
			"Vaulted the Basket Bros Skin set",
			"More maps are now rotated to public servers each update!",
			"Introducing New Dirt 1 and 2! Better gameplay AND FPS! ",
			"Moved Shipyard, Blender, Space Factory, Overcooked and Enchanted to the public map pool",
			"Moved Ruins, Sparta, Trainyard, Wreckage and Catacombs to the private map pool"
			]
		},
		{
	   "version": "0.42.10",
	   "date": "May 2 2022",
	   "content": [
		  "RAWR! The latest set of Dinosaur Skins have crashed into the store!",
		  "The Pterodactyl Wings are available in the store and free for all VIP members",
		  "Vaulted the Relic and Easter Skin sets",
		  "Introducing new map Growler to the public map pool and King of the Coop!",
		  "Moved Fort Flip, Cluckgrounds and Helix to the public map pool",
		  "Moved Blue, Jailbreak, Stage, Castle, Palace Siege and Feedlot to the private map pool"
	   ]
	},
	{
	   "version": "0.42.9",
	   "date": "April 14 2022",
	   "content": [
		  "Rejoice! EGG ORG has been defeated with the hidden code found on Timetwist!",
		  "Twitch Drops: Relics starts on the 15th! <a target='_blank' title='here' href='https://shellshock.io/twitch/?utm_medium=referral&utm_campaign=changelog'>Link Twitch and Shell Shockers accounts</a> to unlock EGG ORG Relics.",
		  "Redeem code '5831' in Shell Shockers to see how EGG ORG was defeated.",
		  "All eggs that survived EGG ORG recieve the Shattered EGG ORG crest!",
		  "The premium Retro AK is available in the shop and free for all VIP members",
		  "Added a range of Twitch emotes and Twitch items to the shop!",
		  "Vaulted the EGG ORG skins",
		  "This update features skins from creators: Graysocean, JWBerry3D and Polarized Moon!",
		  "Moved Two Towers, Kings Court and Road to the public map pool",
		  "Moved Scales, Enchanted, and Sky Scratcher to the private map pool"
	   ]
	},
	{
	   "version": "0.42.8",
	   "date": "April 1 2022",
	   "content": [
		  "<h3>EGG ORG have returned!</h3>",
		  "<p>Last year, EGG ORG HQ became Wreckage, as EGG ORG was blasted into space in their desire to crack Pablo once & for all. That should have been the end of it… Unfortunately, EGG ORG's top eggheads devised a desperate plan, diverting the spinning wreckage into a wormhole. However unlikely their plan was.. it worked. What was left of EGG ORG somehow ended up back on earth, 502 years in the past. Using their advanced evil bureaucracy, they created a foothold of power, affecting the future & once again threatening Shell Shockers & the very future of all Egg Kind. They have already started to take control of the present...</p>",
		  "<p>We have sent Pablo back in time, to finish EGG ORG before the takeover is complete. Can you help him find the code?</p>",
		  "EGG ORG have returned! Attacking medieval Eggtopia from the past!",
		  "Our last hope, we have sent Pablo back into the past to fight for all eggkind.",
		  "Chick'n Winner now offers extra large prizes! ",
		  "The premium EGG ORG Cannonball has blasted into the shop and free for all VIP members",
		  "Tweaks to Ruins, Kings Court, Enchanted and Field",
		  "Introducing Timetwist - The maze-like medieval EGG ORG Base",
		  "Timetwist and Wreckage added to the KotC game mode!",
		  "Moved Trainyard, Wreckage and Shellville to the public map pool",
		  "Moved Mud Gulch, Junction, and Shipyard to the private map pool"
	   ]
	},
	{
	   "version": "0.42.7",
	   "date": "March 15 2022",
	   "content": [
		  "It's March Madness and the Basketbros.io update! Choose your team skins in the shop!",
		  "Play Basket Bros today to unlock the eggsclusive Basketball Grenade!",
		  "Added the Premium Basket Bros Shotgun to the shop and free for all VIP members!",
		  "It's official - lower price Premium items are in the shop to stay!",
		  "Moved Sparta, Moonbase and Ruins to the public map pool",
		  "Moved Blender, Fort Flip, and Space Factory to the private map pool"
	   ]
	},
	{
	   "version": "0.42.6",
	   "date": "March 3 2022",
	   "content": [
		  "Welcome to the We Stand with Ukraine update.",
		  "We have two special items in the shop, the Premium Ukraine Bandana, where all proceeds go towards the <a target='_blank' title='Save the Children’s Ukraine Crisis Relief Fund' href='https://support.savethechildren.org/site/Donation2?df_id=5751&mfc_pref=T&5751.donation=form1'>Save the Children’s Ukraine Crisis Relief Fund</a> and the Heart Ukraine stamp, that you can wear in-game to show your support.",
		  "Ukraine’s children are in grave danger of physical harm, severe emotional distress and mass displacement. Your purchase of the Ukraine Bandana is a donation to help provide children and families with immediate aid, such as food, water, hygiene kits, and psychosocial support."
	   ]
	},
	{
	   "version": "0.42.5",
	   "date": "March 1 2022",
	   "content": [
		  "Grab the luck of the Irish, St. Patricks day skins now in store!",
		  "Added the Premium Lucky Clover Wings for all VIP members!",
		  "By popular demand, Kawaii Skins will remain in the shop",
		  "Vaulted Valentine's and a host of older skins",
		  "Tweaked maps: Cluckgrounds, Overcooked, Jailbreak, Catacombs and Mud Gulch",
		  "Adding 2 new duel maps, Eggcrates and Bridge to the Private map pool",
		  "Added Eggcrates and Jailbreak to the King of the Coop game mode!",
		  "Moved Catacombs, Jailbreak and Shellville to the public map pool",
		  "Moved Overcooked, Cluckgrounds, and Two Towers to the private map pool"
	   ]
	},
	{
	   "version": "0.42.4",
	   "date": "February 15 2022",
	   "content": [
		  "Nate's Nook skins - a collection based on <a target='_blank' title='game prototypes' href='https://bluewizard.com/nate/?utm_source=shellshockers&utm_medium=referral&utm_campaign=changelog'>game prototypes</a> by resident Wizard, Nate ",
		  "Added the Premium Retro RPEGG for all VIP members!",
		  "Introducing the Chick'n Winner! Play now for more eggs",
		  "Greatly improved mobile play by adding manual fire options",
		  "Vaulted Chilly skins",
		  "Added 3 new maps to the King of the Coop rotation!",
		  "Moved Sky Scratcher, Stage and Blue to the public map pool",
		  "Moved Trainyard, King's Court, and Bastion to the private map pool"
	   ]
	},
	{
	   "version": "0.42.3",
	   "date": "February 1 2022",
	   "content": [
		  "Kawaii! The cutest new skins ever are in the shop now! ",
		  "Added the Valentine's Day skin set for all of February",
		  "Added the Premium Octopus Grenade for all VIP members!",
		  "Vaulted Meggtrix skins",
		  "Added new map Enchanted to the public map pool",
		  "Added 3 new maps to the King of the Coop rotation!",
		  "Moved Castle, Feedlot and Palace Siege to the public map pool",
		  "Moved Dirt, Dirt 2, and Sparta to the private map pool"
	   ]
	},
	{
	   "version": "0.42.2",
	   "date": "January 17 2022",
	   "content": [
		  "Twitch Drops Event hype! <a target='_blank' title='Sign up now!' href='https://shellshock.io/twitch'>Sign up now</a> to get items by watching Shell!",
		  "Added the Chilly skin series to the store for one month only",
		  "Added 2x Premium items for VIP members - Supernova Grenade AND Pixel Rainbow Wings!",
		  "Fixed team balance and switching issues in King of the Coop",
		  "Map piece edits abound - Loading times are now faster!",
		  "Follow us on Twitch - click the link on the homepage footer to get a free skin!",
		  "Vaulted Eggsmas and New Year Skins",
		  "Added new map Scales to the public map pool",
		  "Added 4 new maps to the King of the Coop rotation!",
		  "Moved Junction, Mud Gulch and Blender to the public map pool",
		  "Moved Road, Moonbase, and Ruins to the private map pool"
	   ]
	},
	{
	   "version": "0.42.1a",
	   "date": "December 21 2021",
	   "content": [
		  "Fixed outline color deviations in some team modes",
		  "Fixed errant King of the Coop zone on Bastion",
		  "Fixed scores not updating properly in Captula the Spatula"
	   ]
	},
	{
	   "version": "0.42.1",
	   "date": "December 15 2021",
	   "content": [
		  "Happy New Yolk! 2022 items added!",
		  "VIP is now available for purchase on Mobile! ",
		  "Customise your controls on Shell Mobile! ",
		  "King of the Coop - Public lobbies now team balance between rounds",
		  "King of the Coop - Team swapping to losing team and winning awards bonus",
		  "Added Meggtrix skins for this month only! ",
		  "Become a VIP and get the Pixel Butterfly Wings",
		  "Degg the Halls - Eggsmas decorations added to the NEW public maps",
		  "King of the Coop - added more zone spawn points to Bastion",
		  "Added a few more Christmas skins under the tree (inventory)! ",
		  "Moved Helix, Dirt, and Catacombs to the private map pool",
		  "Moved Fort Flip, Trainyard and Shipyard to the public map pool"
	   ]
	},
	{
	   "version": "0.42.0a",
	   "date": "December 01 2021",
	   "content": [
		  "NEW MODE: King of the Coop added! [WIP]",
		  "Tis the Season - Eggsmas skins added",
		  "Added King of the Coop skins",
		  "Added the Eggs of Legends skins for this month only",
		  "Become a VIP and get the Premium Retro Whipper",
		  "Deck the Halls - Eggsmas decorations added to all public maps",
		  "New map - King's Court added to public map pool",
		  "Map Helix revamped, more narrow spiral",
		  "Vaulted Halloween and Black Fryday skins",
		  "Moved Fort Flip, 4 quarters, Sky Scratcher, and Stage to the private map pool",
		  "Moved Feedlot, Bastion and Space Factory to the public map pool"
	   ]
	},
	{
	   "version": "0.41.1",
	   "date": "November 16 2021",
	   "content": [
		  "New VIP item - Thermal Wings now available!",
		  "Black Fryday approaches.. and we're hungry!",
		  "Edits made to Road - now has cars!",
		  "Halloween items vaulted",
		  "Halloween maps moved to private",
		  "Moved Trainyard, Jailbreak and Shellville to the private map pool",
		  "Helix, Sparta and Road moved to the public map pool"
	   ]
	},
	{
	   "version": "0.41.0",
	   "date": "November 1 2021",
	   "content": [
		  "Added the eggsclusive Thermal Detonator to the Egg Shack!",
		  "Added the Thanksgiving skin series for this month only. Delicious.",
		  "Implemented over 10 small Quality of Life bug fixes! ",
		  "Extended the Halloween set for 2 more weeks! ",
		  "Added new map Dirt Too into both map pools",
		  "Moved Overcooked, Sky Scratcher and Fort Flip to the public map pool",
		  "Moved Blue, Castle and Junction to the private map pool"
	   ]
	},
	{
	   "version": "0.40.9",
	   "date": "October 15 2021",
	   "content": [
		  "Sweet Treats! Moar Scary Stamps and Ghoulish Guns",
		  "Premium Moth Pixel Wings - Winged Doom for all VIP Players",
		  "Special edition Shell Game Stamps",
		  "Updates made to Jinx to create better pathing",
		  "Moved Dirt, Stage and Moonbase to the public map pool",
		  "Moved Sparta, Rameses, and Wreckage to the private map pool"
	   ]
	},
	{
	   "version": "0.40.8",
	   "date": "October 1 2021",
	   "content": [
		  "Introducing the Halloween Skin set for this month only!",
		  "Dare you try the howling new Halloween Map - Jinx?",
		  "Premium Retro Scrambler gifted to all VIP members",
		  "New Golden Beak stamp and updated VIP skins added for all VIP members!",
		  "Updates made to 4 Quarters to add more close range play!",
		  "Moved 4 Quarters, Jinx and Haunted to the public map pool",
		  "Moved Palace Siege, Helix, and Mud Gulch to the private map pool"
	   ]
	},
	{
	   "version": "0.40.7",
	   "date": "September 15 2021",
	   "content": [
		  "Introducing the hawt Premium Glitch Wings available to all VIP members",
		  "Added the winning Brothers skins to the store!",
		  "Wero Returns - Wear the Wero. Throw the Wero. Watch the Wero.",
		  "Map Stax Arena gets a minor upgrade",
		  "Moved Junction, Ruins and Trainyard to the public map pool",
		  "Moved Blender, Road, and Shipyard to the private map pool"
	   ]
	},
	{
	   "version": "0.40.6",
	   "date": "September 1 2021",
	   "content": [
		  "Introducing the A+ Skin set for this month only! ",
		  "Premium Glitterbomb Grenade gifted to all VIP members",
		  "Massive Map upgrade! Try New Jailbreak, Catacombs, Rameses, Space Arena, Bastion, AND Sparta!",
		  "Moved Jailbreak, Catacombs and Rameses to the public map pool",
		  "Moved Space Factory, Feedlot, and Overcooked to the private map pool"
	   ]
	},
	{
	   "version": "0.40.5",
	   "date": "August 15 2021",
	   "content": [
		  "Premium Pixel Fire Wings available to all VIP members",
		  "Added the eggciting ChantiGG Skins to the store!",
		  "Moved Cluckgrounds, Two Towers and Wreckage to the public map pool",
		  "Moved Sky Scratcher, Jailbreak, and Junction to the private map pool"
	   ]
	},
	{
	   "version": "0.40.4",
	   "date": "August 1 2021",
	   "content": [
		  "Premium Retro Free Ranger available to all VIP members",
		  "Rereleasing the out of this world Galeggsy skins for this month only",
		  "Follow us on Twitter to gain the Twitter Hat! ",
		  "Twisted! Added new map Helix to the public map pool",
		  "Moved Sparta, Mud Gulch and Shellville to the public map pool",
		  "Moved Dirt, Moonbase, and Fort Flip to the private map pool"
	   ]
	},
	{
	   "version": "0.40.3",
	   "date": "July 15 2021",
	   "content": [
		  "Wipe em off the map with the new Premium Item - TP Wings",
		  "Added the eggscellent Lyerpald pistol & stamp to the store!",
		  "Added the Blue Wizard Stamp to the store!  ",
		  "Moved Palace Siege, Shipyard and Road to the public map pool",
		  "Moved Stage, Ruins and Stax Arena to the private map pool"
	   ]
	},
	{
	   "version": "0.40.2",
	   "date": "July 1 2021",
	   "content": [
		  "Premium TP Grenade available to all VIP members",
		  "Introducing the Summer series of skins for this month only",
		  "Follow us on Facebook to gain the Facebook Hat! ",
		  "Added new Duel maps: Rivals and Stax Arena",
		  "Small edits to map Trainyard to allow for more movement",
		  "Moved Blender, Blue and Castle to the public map pool",
		  "Moved Catacombs, Trainyard, and Temple to the private map pool"
	   ]
	},
	{
	   "version": "0.40.1",
	   "date": "June 15 2021",
	   "content": [
		  "New Premium Item - Pixel Fairy Wings ",
		  "Added the eggscellent Ethan Gamer skin series to the store!",
		  "Moved Catacombs, Space Factory and Junction to the public map pool",
		  "Moved Wreckage, Two Towers and Cluckgrounds to the private map pool",
		  "Fixed small issues with Dirt & Jailbreak maps "
	   ]
	},
	{
	   "version": "0.40.0",
	   "date": "June 1 2021",
	   "content": [
		  "Shell Mobile released worldwide on iOS. <a target='_blank' title='Download now' href='http://onelink.to/6vfqw2'>Download Now</a> to get an exploding Cell Phone Grenade! ",
		  "Added the Premium Retro Crackshot to all VIP eggs and egg shack",
		  "Added the Merc Zone weapons to the store!",
		  "Click the homepage link to follow us on Steam & receive the Face Crab skin",
		  "New VIP button for easier access!",
		  "Added new map Junction to the private map pool",
		  "Moved Feedlot, Dirt and SkyScratcher to the public map pool",
		  "Moved Sparta, Mud Gulch, and Shellville to the private map pool",
		  "Removed stranded spatula spot from Stage map"
	   ]
	},
	{
	   "version": "0.39.8",
	   "date": "May 17 2021",
	   "content": [
		  "Trainyard reworked - Less long sightlines, slightly smaller, & 2x as good",
		  "Stage improved - Fixed see through blocks, expanded dancefloor! ",
		  "Added the RandomLife skin series to the store",
		  "Moved Trainyard, Stage and Moonbase to the public map pool",
		  "Moved Castle, Shipyard and Palace Siege to the private map pool",
		  "New loading bar! Get cracked in style!"
	   ]
	},
	{
	   "version": "0.39.7",
	   "date": "May 1 2021",
	   "content": [
		  "All Aboard! New Trainyard blocks added to the game ",
		  "Added the Trainyard skin series to the store",
		  "Added the Vehicle Weapon Pack to the store!",
		  "Vaulted the Easter skin series",
		  "Added new map Trainyard to the private map pool",
		  "New map rotations - Every update the public maps will change!",
		  "Moved Temple, Fort Flip and Jailbreak to the public map pool",
		  "Moved Road, Blender, and Blue to the private map pool"
	   ]
	},
	{
	   "version": "0.39.6",
	   "date": "April 15 2021",
	   "content": [
		  "Joy! EGG ORG is defeated - The Wizards have returned",
		  "Rejoice! Pablo skins returned to inventory",
		  "EGG ORG HQ destroyed at their own hands",
		  "Disregard Diablo - Acquire Pablo",
		  "Moved Catacombs, Space Factory and Feedlot to the private map pool",
		  "Moved Overcooked, Ruins and added Wreckage to the public map pool"
	   ]
	},
	{
	   "version": "0.39.5c",
	   "date": "April 1 2021",
	   "content": [
		  "EGG ORG has taken control",
		  "Added the premium Pixel Tri-Hard to the Egg Shack!  ",
		  "Added the eggsquisite EGG ORG stamps to the Shop!",
		  "Follow us! BWD TikTok link added to homepage",
		  "Disregard Pablo - Acquire Diablo ",
		  "Edited scoreboards - watch for favorite Content Creator",
		  "Added the Easter skin series for this month only",
		  "Vaulted the St Patricks Day series",
		  "Added the new map <strike>Trainyard</strike> EGG ORG HQ to the public map pool",
		  "Obliterated the map Ruins. It will not be missed.",
		  "Moved Dirt, Moonbase and Skyscratcher to the private map pool",
		  "Moved Two Towers, Mud Gulch and Shellville to the public map pool"
	   ]
	},
	{
	   "version": "0.39.4",
	   "date": "March 15 2021",
	   "content": [
		  "Fancy Necromancy - Added the premium Skull Wings to the Egg Shack! ",
		  "Check it out - Added happy bouncing T-shirt Merch link!",
		  "Follow us! BWD TikTok link added to homepage",
		  "Mouth Stamps - Added a new stamp set to the store",
		  "Extra Hats - EarPods, Paperbag, Hipster, Beret, Spike",
		  "Small patches to maps: Dirt and Castle"
	   ]
	},
	{
	   "version": "0.39.3",
	   "date": "March 1 2021",
	   "content": [
		  "Added the premium Skullnado to the Egg Shack! ",
		  "Homepage - Rotisserie added giving Shell Youtubers some limelight",
		  "Homepage - Added the Blue Wizard Digital discord hat offer",
		  "Added the St. Patricks Day skin series for this month only",
		  "Added the Pixel Stamp set to the Shop!",
		  "Vaulted the Groundhog series",
		  "Added new map Downfall to the private map pool",
		  "Moved Cluckgrounds, Sparta and Dirt to the public map pool",
		  "Moved Rameses, Jailbreak and Overcooked to the private map pool",
		  "Small updates to Dirt, Jailbreak, Overcooked, Rameses, Palace Siege, Space Factory, 4 Quarters, Castle Arena!"
	   ]
	},
	{
	   "version": "0.39.2",
	   "date": "Febuary 15 2021",
	   "content": [
		  "Try hard with the new TriHard burst rifle!",
		  "Fixes to ammo synchronization",
		  "Action-queuing. Less button-mashing FTW!",
		  "Egg is now poseable in menus when moused-over",
		  "Free Ranger fire rate increased slightly, full reload slightly faster",
		  "EggK-47 accuracy increased, bloom and reload time decreased",
		  "Whipper clip size reduced to 40 rounds",
		  "Booted players now kept out of game with greater reliability",
		  "STREAMTASTIC: Added Hazmatt and C4bra skins to the store",
		  "HOLY S**T: New premium item, Pixel Angel Wings added"
	   ]
	},
	{
	   "version": "0.38",
	   "date": "n/a",
	   "content": [
		  "Added the premium Holy Hand Grenade to the VIP benefits! ",
		  "Added the eggsclusive Retro Cluck 9MM to the Egg Shack!",
		  "Removed the Techno RPEGG from the Egg Shack",
		  "Added the Groundhog Day skin series for this month only",
		  "Vaulted the New Year 2021 series",
		  "Added new map Sparta to the private map pool",
		  "Moved Rameses, Palace Siege and Shipyard to the public map pool",
		  "Moved Two Towers, Cluckgrounds and Fort Flip to the private map pool"
	   ]
	},
	{
	   "version": "0.37",
	   "date": "n/a",
	   "content": [
		  "Added the eggsclusive Techno RPEGG to the Egg Shack!",
		  "Removed the Steampunk Wings from the Egg Shack",
		  "Added the eggsquisite Thee_Owl Skins ",
		  "Introducing Grenade skins and effects - BOOM"
	   ]
	},
	{
	   "version": "0.36",
	   "date": "n/a",
	   "content": [
		  "Added the eggsclusive Steampunk wings to the Egg Shack!",
		  "Removed the Techno EggK-47 from the Egg Shack",
		  "Added the New Year 2021 skin series for this month only",
		  "Vaulted the Eggsmas series",
		  "Added new map Rameses to the private map pool",
		  "Moved Overcooked to the public map pool",
		  "Moved Mud Gulch to the private map pool"
	   ]
	},
	{
	   "version": "0.35",
	   "date": "n/a",
	   "content": [
		  "Added the eggsclusive Techno Eggk-47 to the Egg Shack! ",
		  "Added the muy caliente Wero Hats and Stamp to the Shell store",
		  "Removed the Chrome Wings to the Egg Shack"
	   ]
	},
	{
	   "version": "0.34",
	   "date": "n/a",
	   "content": [
		  "Tweaks to The most Fantabulous VIP club!",
		  "Added the eggsclusive Chrome Wings to the Egg Shack!",
		  "Removed the Techno Free Ranger from the Egg Shack",
		  "Added the Eggsmas skin series for this month only",
		  "Vaulted the Thanksgiving skin series",
		  "Added new map Overcooked to the private map pool",
		  "Updated maps Dirt Arena & Blender",
		  "Moved Catacombs, Blue & Blender to the public map pool",
		  "Moved Haunted & Dirt to the private map pool"
	   ]
	},
	{
	   "version": "0.33",
	   "date": "n/a",
	   "content": [
		  "Announcing the The Most Fantabulous VIP update!",
		  "VIP Golden Wings!",
		  "Eggclusive items as they come out!",
		  "x2 Eggs - ALL THE TIME",
		  "More EggShell Colors",
		  "NO MORE ADS! ",
		  "All for less than $5 USD / month"
	   ]
	},
	{
	   "version": "0.322",
	   "date": "n/a",
	   "content": [
		  "Preparing for something new..."
	   ]
	},
	{
	   "version": "0.32",
	   "date": "n/a",
	   "content": [
		  "Introduced the Premium Catz Free Ranger - The Purrfect weapon",
		  "Vaulted the Halloween items",
		  "Removed the Fallen Wings from the Egg Shack"
	   ]
	},
	{
	   "version": "0.31",
	   "date": "n/a",
	   "content": [
		  "Added the eggsclusive Fallen Wings to the Egg Shack!",
		  "Removed the BADOOSH scrambler from the Egg Shack",
		  "Added the Thanksgiving series for this month only",
		  "Vaulted the Halloween Skin series",
		  "Added new map Catacombs to the private map pool",
		  "Moved Jailbreak to the public map pool",
		  "Moved Shellville to the private map pool"
	   ]
	},
	{
	   "version": "0.30",
	   "date": "n/a",
	   "content": [
		  "Added the BADOOSH Scrambler to the Egg Shack!",
		  "Removed the Demon Wings from the Egg Shack"
	   ]
	},
	{
	   "version": "0.29",
	   "date": "n/a",
	   "content": [
		  "Tweaked vertices wizardry means an average of 5 FPS eggstra!",
		  "Added the Limited Edition Demon Wings to the Egg Shack!",
		  "Added the Halloween skin series for this month only",
		  "Launched the Stampede! event with over 20 stamps added",
		  "Includes contest stamps from: Thee_Owl, Waldoh?, Egginator, Don Huevo and Jasper",
		  "Vaulted the Chicken skin series",
		  "Added new map Haunted directly to the public map pool",
		  "Moved Jailbreak to the private map pool"
	   ]
	},
	{
	   "version": "0.28.6",
	   "date": "n/a",
	   "content": [
		  "Updates to new map lighting and shaders"
	   ]
	},
	{
	   "version": "0.28.5",
	   "date": "n/a",
	   "content": [
		  "New Lighting System Implemented! Better colours / Better Shadows",
		  "Improved unseen verticies - You may notice an FPS increase!",
		  "Fixed some issues with simultanious code redemtion. ",
		  "Included new <a target='_blank' title='Get the Friday the 13th puzzle game here.' href='http://www.f13killerpuzzle.com/xboxone'>Friday the 13th: Killer Puzzle</a> Stamp"
	   ]
	},
	{
	   "version": "0.28.4",
	   "date": "n/a",
	   "content": [
		  "New Premium item added - The Epic Rooster Wings!",
		  "Pop-pop Premium item vaulted",
		  "Spawn points on Stage improved",
		  "Added the Chicken Skin series for this month only",
		  "Vaulted the Gallegsy skin series",
		  "Added new map Blender to the private map pool",
		  "Moved Feedlot and Road to the public map pool",
		  "Moved Stage and Blue to the private map pool"
	   ]
	},
	{
	   "version": "0.28.3",
	   "date": "n/a",
	   "content": [
		  "New Premium item added - Pop-Pop 9mm. POP!",
		  "Gallegsy Wings Premium item vaulted",
		  "Mud Gulch subtley improved. Can you find it?"
	   ]
	},
	{
	   "version": "0.28.2",
	   "date": "n/a",
	   "content": [
		  "New audio engine that will actually work on your terrible laptop!",
		  "Added an Eggsclusive hat to the Egg Shack!",
		  "Added the Galleggsy Skin series for this month only",
		  "Vaulted the Rockstar Skin series",
		  "Added new map Four Quarters to the private map pool",
		  "Edits made to Bastion to improve player flow",
		  "Moved Two Towers and Stage to the public map pool",
		  "Moved Dirt and Road to the private map pool"
	   ]
	},
	{
	   "version": "0.28.1",
	   "date": "n/a",
	   "content": [
		  "Added KILLSTREAKS! Get 5 Kills to earn the Hardboiled armor powerup! Get 10 kills to earn the Eggbreaker damage multiplier!",
		  "Added NEW PREMIUM ITEMS! Check the Store for 8 new ultra-rare hats and skins!"
	   ]
	},
	{
	   "version": "0.27.82",
	   "date": "n/a",
	   "content": [
		  "Poki stuff"
	   ]
	},
	{
	   "version": "0.27.81",
	   "date": "n/a",
	   "content": [
		  "Added an Eggslusive weapon to the Egg Shack!",
		  "Can you feel the music? New Droppin' Mad Beaks event",
		  "Added the Rockstar Skin series for this month only",
		  "Added Map Stage to the private map pool",
		  "Updated Map Space Factory - now even rampierer",
		  "Moved Castle and Space Factory to the public map pool",
		  "Moved Two Towers and Feedlot to the private map pool"
	   ]
	},
	{
	   "version": "0.27.8",
	   "date": "n/a",
	   "content": [
		  "Added an Eggslusive weapon to the Egg Shack!",
		  "Can you feel the music? New Droppin' Mad Beaks event",
		  "Added the Rockstar Skin series for this month only",
		  "Added Map Stage to the private map pool",
		  "Updated Map Space Factory - now even rampierer",
		  "Moved Castle and Space Factory to the public map pool",
		  "Moved Two Towers and Feedlot to the private map pool"
	   ]
	},
	{
	   "version": "0.27.7",
	   "date": "n/a",
	   "content": [
		  "Add new egg store sale notification"
	   ]
	},
	{
	   "version": "0.27.6",
	   "date": "n/a",
	   "content": [
		  "Add new popup for sale items"
	   ]
	},
	{
	   "version": "0.27.5",
	   "date": "n/a",
	   "content": [
		  "Added the Rotten Skin series for this month only",
		  "Added Map Temple to the private map pool",
		  "Added the Scorched Horizon Mask to the shop",
		  "Moved Fort Flip and Moonbase to the public map pool",
		  "Moved Castle and Palace Siege to the private map pool"
	   ]
	},
	{
	   "version": "0.27.4",
	   "date": "n/a",
	   "content": [
		  "New setting: Safe Names - Randomizes all player names"
	   ]
	},
	{
	   "version": "0.27.3",
	   "date": "n/a",
	   "content": [
		  "Added the Amazing Raid.Land Skins",
		  "Added Bastion Map to the private Map Pool",
		  "Fixed Ladder Glitches on Jailbreak",
		  "Vaulted Easter Items",
		  "Moved Moonbase to the private map pool",
		  "Moved Skyscratcher to the public map pool!"
	   ]
	},
	{
	   "version": "0.27.2",
	   "date": "n/a",
	   "content": [
		  "The Blue Wizards have escaped! ",
		  "EGG ORG is gone... for now. It will take time to return things to normal",
		  "STAY INSIDE - Edited Map Biohazard to remove bugs",
		  "New map Jailbreak added to Private games",
		  "Vaulted Evil EGG ORG Stamp"
	   ]
	},
	{
	   "version": "0.27.1",
	   "date": "n/a",
	   "content": [
		  "All Hail our Glorious Corporate Overlords, EGG ORG! - stamp now in store.",
		  "STAY INSIDE - Added Map Biohazard to the private map pool",
		  "WASH HANDS - Added Face Masks to the store",
		  "Vaulted Saint Patricks Day skins",
		  "Added Easter skins and cosmetics "
	   ]
	},
	{
	   "version": "0.27.0",
	   "date": "n/a",
	   "content": [
		  "Added Gamepad Support! You can now find extra options in the setting menu",
		  "A whole host of bug fixes!",
		  "Fixes to Castle Map"
	   ]
	},
	{
	   "version": "0.26.4",
	   "date": "n/a",
	   "content": [
		  "Added Quick-Switch weapon select on respawn menu - Noice",
		  "Your favorite Chicken Nugget has had a makeover",
		  "Added Map 'Sky Scratcher' to the private map pool",
		  "Vaulted Valentine's Day Skins",
		  "Added Saint Patrick's Day skins - Too Ra Loo!",
		  "Updated 'Space Factory' map with better bullet collision",
		  "Minor 'Road' map updates"
	   ]
	},
	{
	   "version": "0.26.3",
	   "date": "n/a",
	   "content": [
		  "Every weekend in February is a DOUBLE XP weekend!",
		  "Changes to Mud Gulch and Space Arena, now at least 1.4 times as fun",
		  "Moved Fort Flip to Private and Mud Gulch to public",
		  "Added Map Space Factory to the private map pool",
		  "Added Hyper Eggspensive Egg in Black skins",
		  "Added Valentines Skins for the month of February",
		  "Added enhanced 2X Egg functionality and UI elements",
		  "New Years Eve skins have been vaulted",
		  " Extra Language support added for non-English Players"
	   ]
	},
	{
	   "version": "0.26.2",
	   "date": "n/a",
	   "content": [
		  "Christmas and Eggwalker skins have been vaulted",
		  "New Years and Nuke Zone skins have been added to the store",
		  "New map Mud Gulch added to the private map pool",
		  "Cluckgrounds updated AND moved to the Public Map Pool",
		  "By popular demand, Ruins has been added back to the Public Map Pool"
	   ]
	},
	{
	   "version": "0.26.1",
	   "date": "n/a",
	   "content": [
		  "New functionallity added for Double Egg Weekend",
		  "Get Yolked this weekend with DOUBLE THE EGGS (Golden Nugget = 4X eggs this weekend)",
		  "Map Cluckgrounds updated with a more open downstairs"
	   ]
	},
	{
	   "version": "0.26.0",
	   "date": "n/a",
	   "content": [
		  "Christmas and Eggwalker skins are available in the store",
		  "New map Cluckgrounds added to the private map pool",
		  "Palace Siege moved to the Public Map Pool",
		  "Enhanced backend bugfixes",
		  "Return of the nugget"
	   ]
	},
	{
	   "version": "0.25.7",
	   "date": "n/a",
	   "content": [
		  "A host of more unexciting bug fixes and security patches. ",
		  "Improved SEO functions on the main page and other things you probably don't care about. Read it now by scrolling down... umm... after the changelog is closed."
	   ]
	},
	{
	   "version": "0.25.6",
	   "date": "n/a",
	   "content": [
		  "A host of unexciting bug fixes and security patches. ",
		  "The Chicken Nugget is back from holiday and once again, doubling eggs for an hour"
	   ]
	},
	{
	   "version": "0.25.5",
	   "date": "n/a",
	   "content": [
		  "New default weapons - look better, sound better, plays the same!",
		  "Vaulted the Guy Fawkes Mask",
		  "Small map balance tweaks to Moon Arena and Road",
		  "Spatula added to Palace Siege",
		  "General Bug Fixes"
	   ]
	},
	{
	   "version": "0.25.4",
	   "date": "n/a",
	   "content": [
		  "Happy Thanksgiving! Enjoy some turkey with your eggs with a bunch of festive skins.",
		  "Vaulted the Halloween items.",
		  "Added Map: Dual Pyramid to the private map pool.",
		  "Added Map: Palace Siege to the private map pool.",
		  "Road has been moved to a public map, look for it in the regular rotation.",
		  "Ruins has been moved to a private only map."
	   ]
	},
	{
	   "version": "0.25.3",
	   "date": "n/a",
	   "content": [
		  "Some refinements to the new collision detection to prevent some strange things that you probably thought where fun. TOO BAD.",
		  "Patched up a few holes in the maps, because some of those were fun, too."
	   ]
	},
	{
	   "version": "0.25.2",
	   "date": "n/a",
	   "content": [
		  "Halloween items are back for you and your BOO... Sorry.",
		  "FIX grenades sometimes flying off in random directions.",
		  "FIX cases where weapons would occasionally become completely ineffective.",
		  "FIX certain instances where some shots would fail to register."
	   ]
	},
	{
	   "version": "0.25.1",
	   "date": "n/a",
	   "content": [
		  "Updates to the 1v1 Metadata",
		  "Make the Egg Clickable on the Title Screen",
		  "General minor bug fixes and Optimizations"
	   ]
	},
	{
	   "version": "0.24.1",
	   "date": "n/a",
	   "content": [
		  "Updates to the new 1v1 Maps -- more hidey hidey.",
		  "Fixed a bug where redeeming a code currently does not populate in inventory until you refresh.",
		  "Fixed a bug where people's names were getting capitalized on the Kill/Death message.",
		  "Added a sign in button to anonymouse warning popup."
	   ]
	},
	{
	   "version": "0.23.3a",
	   "date": "n/a",
	   "content": [
		  "Check out our fresh new look!",
		  "New 'Memphis' weapon skins available in the shop!",
		  "Celebrate ShellShockers' 2nd birthday with some new hats and decals!",
		  "New 1v1 / Competitive Maps!",
		  "Fix for some weapon reloading/ammo pickup problems",
		  "Fix for some issues caused by spam-jumping",
		  "Fix for volume settings not being honored",
		  "Fix for a number of chat issues",
		  "Sanity checks for mouse movement to help mitigate spikes on some systems"
	   ]
	},
	{
	   "version": "0.21.4",
	   "date": "n/a",
	   "content": [
		  "Games no longer crash when a booted player attempts to rejoin",
		  "An attempted fix for some jumping and shooting inconsistencies"
	   ]
	},
	{
	   "version": "0.21.3",
	   "date": "n/a",
	   "content": [
		  "At long last, SPECTATOR MODE, available from the in-game menu. Make sure to check out the Settings menu for exclusive spec mode control options."
	   ]
	},
	{
	   "version": "0.21.2",
	   "date": "n/a",
	   "content": [
		  "Fixed some bugs pertaining to jumping, which just created some new ones. Yay!",
		  "Fixed problems with the Auto Detail checkbox in the Settings menu",
		  "July 4th stamp! And uhhh... yeah, that's it",
		  "A bunch of server-side stuff that's nice for me, but you won't care about"
	   ]
	},
	{
	   "version": "0.21.1",
	   "date": "n/a",
	   "content": [
		  "Dramatically-improved movement synchronization. MUCH ACCURACY. VERY SMOOTHNESS.",
		  "Projectile latency compensation (up to 500ms). It's almost like a real FPS. Almost.",
		  "Fixed some wonky rotation sync issues that were causing stray bullets and grenades.",
		  "Tracer rounds. EggK-47: Every other bullet is visible. SMEGG: Every third.",
		  "More performant shell fragment effects for non-fatal hits, along with new yolk splats!",
		  "You noticed this already, but you can now see the whole changelog... yeah.",
		  "Fixed that dumb RPEGG animation again.",
		  "Fixed that dumb flickering weapon-swapping animation, too.",
		  "Some substantial server performance enhancements."
	   ]
	},
	{
	   "version": "0.20.2a",
	   "date": "n/a",
	   "content": [
		  "AVEGGERS, ASSEMBLE!"
	   ]
	},
	{
	   "version": "0.20.2",
	   "date": "n/a",
	   "content": [
		  "CSG1 clip and ammo storage capacity increased. Bloom decreased just a smidge",
		  "Fixed a clipping issue with gold SMEGG skin"
	   ]
	},
	{
	   "version": "0.20.1",
	   "date": "n/a",
	   "content": [
		  "<h3>NEW WEAPONS:</h3>",
		  "M2DZ bolt-action rifle.",
		  "SMEGG submachine gun.",
		  "<h3>CHANGES TO OLD WEAPONS</h3>",
		  "EggK-47: 600RPM[+] / 30DMG[-] / Bloom decreased",
		  "Dozen Gauge: 170DMG[-] / Stability, accuracy, and range increased",
		  "RPEGG: 140DMG[-] / Blast radius 2.75[-]",
		  "CSG1: 120RPM[+] / 102DMG[-] / Accuracy <i>very slightly</i> decreased",
		  "Cluck 9mm: 450RPM[-] / 26DMG[+] / Bloom decreased",
		  "Bullet velocity increased a bit across the board",
		  "<h3>ALSO</h3>",
		  "Fix for Castle jump exploit",
		  "Hitting very edge of shell now does at least 10% weapon damage instead of zero"
	   ]
	},
	{
	   "version": "0.20.0",
	   "date": "n/a",
	   "content": [
		  "<h3>NEW WEAPONS:</h3>",
		  "M2DZ bolt-action rifle.",
		  "SMEGG submachine gun.",
		  "<h3>CHANGES TO OLD WEAPONS</h3>",
		  "EggK-47: 600RPM[+] / 30DMG[-] / Bloom decreased",
		  "Dozen Gauge: 170DMG[-] / Stability, accuracy, and range increased",
		  "RPEGG: 140DMG[-] / Blast radius 2.75[-]",
		  "CSG1: 120RPM[+] / 102DMG[-] / Accuracy <i>very slightly</i> decreased",
		  "Cluck 9mm: 450RPM[-] / 26DMG[+] / Bloom decreased",
		  "Bullet velocity increased a bit across the board"
	   ]
	},
	{
	   "version": "0.18.2",
	   "date": "n/a",
	   "content": [
		  "The spatula can no longer boldy go where no egg has gone before (or will)",
		  "Major improvements in sound reliability for all you poor souls with Chromebooks and other puny laptops that get sad when asked to do stuff like... I dunno... PLAY SOUNDS?"
	   ]
	},
	{
	   "version": "0.18.1",
	   "date": "n/a",
	   "content": [
		  "New CAPTULA THE SPATULA game mode is now available! GET SOME.",
		  "Boot player function wasn't working quite right. Now it is.",
		  "Multi-domain support, in case you get blocked."
	   ]
	},
	{
	   "version": "0.17.1",
	   "date": "n/a",
	   "content": [
		  "Valentine's Day items are now available! Love, Shell Shockers.",
		  "RPEGG firing delay removed. Rockets now have a minimum arming range, indicated by the red/green brackets.",
		  "Icons added to leaderboard to indicate golden eggs/nuggets and mute status.",
		  "Oh, and a cool new map. Whatever."
	   ]
	},
	{
	   "version": "0.17.0",
	   "date": "n/a",
	   "content": [
		  "Massive ordinance collision detection overhaul",
		  "A lot more work on grenade dynamics",
		  "Changes to grenade and rocket blast radius and damage",
		  "Updates to some particle effects"
	   ]
	},
	{
	   "version": "0.16.0",
	   "date": "n/a",
	   "content": [
		  "Groundhog Day items! Get them before they see their shadows!",
		  "Private game creators can now boot naughty players.",
		  "You can now mute other players. Their chat will no longer show, and their name will be changed to a random one.",
		  "Black egg shell color had to go. It is now bright green, so you can see those cracks!"
	   ]
	},
	{
	   "version": "0.15.9",
	   "date": "n/a",
	   "content": [
		  "Grenade physics got a major, much-needed overhaul."
	   ]
	},
	{
	   "version": "0.15.8",
	   "date": "n/a",
	   "content": [
		  "Old, cruddy, stale public games are now locked after 2 hours to keep map rotation fresh.",
		  "Team player count balance now enforced once again in public games only.",
		  "Fixes to the Auto Detail option in the Settings menu.",
		  "Did a bunch of boring server stuff to help mitigate lag spikes... at least, the ones that <i>aren't</i> caused by your lousy WiFi.",
		  "Fixed some weapon-switching problems for you people who can't be bothered to wait 2 measly seconds before jumping into the Equipment screen and changing everything."
	   ]
	},
	{
	   "version": "0.15.7",
	   "date": "n/a",
	   "content": [
		  "New settings menu that won't show up blank, offers an option to reset to defaults, and allows you to assign mouse wheel up/down actions.",
		  "New health bar. Much compact and fancy!"
	   ]
	},
	{
	   "version": "0.15.6",
	   "date": "n/a",
	   "content": [
		  "Christmas is so yesterday; Happy New Yolk! New skins are available.",
		  "I know we're a friendly bunch, but nobody likes spawning on top of their teammates, so that shouldn't happen now.",
		  "Servers were having a hard time keeping up with new game requests, leaving a lot of people with 'Matchmaker Offline' messages. I thought that was dumb, so server-side game creation speed has been improved DRAMATICALLY."
	   ]
	},
	{
	   "version": "0.15.5",
	   "date": "n/a",
	   "content": [
		  "Golden Nugget! It's like a Golden Chicken, but kinda not!",
		  "Better, more diverse spawn points",
		  "Improved inter-server communication"
	   ]
	},
	{
	   "version": "0.15.4d",
	   "date": "n/a",
	   "content": [
		  "Golden Chicken Pass! More shell colors! No ads! Buy now!",
		  "New, improved egg death animation. GADZOOKS; THERE'S YOLK EVERYWHERE!"
	   ]
	},
	{
	   "version": "0.15.3",
	   "date": "n/a",
	   "content": [
		  "RPEGG now requires players to stop and get settled before firing. No more rushing people and blowing yourselves up, losers!",
		  "Very slight tweaks to other weapons that I'm not going to tell you about. I'm already regretting just typing this.",
		  "Live Twitch streamer list. WE WILL BE WATCHING."
	   ]
	},
	{
	   "version": "0.15.2",
	   "date": "n/a",
	   "content": [
		  "GOBBLE, GOBBLE, TURKEY... something. Turkey Day skins are here!",
		  "Worked on some server stability nonsense... BOOOORING.",
		  "Before you ask, yes, the RPEGG will be getting some tweaks. Next time!"
	   ]
	},
	{
	   "version": "0.15.1",
	   "date": "n/a",
	   "content": [
		  "Brand new EGGSPLODER class, weilding the mighty RPEGG! Yeah, it's a new gun; don't have a heart-attack. Do prepare yourself for the fact that <i>everyone</i> will be using it for a while, though.",
		  "Fixed an issue where new games couldn't be created on a server after a while. If you see a message complaining about the match-maker, just give it a moment and try again.",
		  "Fixed an issue where you could only enter 2 lines of smack in chat while dead."
	   ]
	},
	{
	   "version": "0.14.7",
	   "date": "n/a",
	   "content": [
		  "<h3>Fixes for all of the following annoying stuff:</h3>",
		  "Invincibile players",
		  "Indivisible players",
		  "Inadmissible players",
		  "Inadvisable players",
		  "Inconceivable players",
		  "Incomprehensible players",
		  "Just kidding about all but the first one; especially the last one.",
		  "Probably fixed some other things in the process. It was that bad."
	   ]
	},
	{
	   "version": "0.14.6",
	   "date": "n/a",
	   "content": [
		  "<h3>What's New</h3>",
		  "New scare-your-pants-off Halloween items!",
		  "<h3>Bug Fixes</h3>",
		  "Some server stability issues"
	   ]
	}
 ]